{
    "Place": [
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Triveni Ghat",
            "category": "Spiritual / Religious",
            "lat": 30.1038,
            "lon": 78.2993,
            "address": "Triveni Ghat, Mayakund, Rishikesh, Uttarakhand 249201",
            "locationLink": "https://maps.app.goo.gl/Bf13jG4ofZJzfkSCA",
            "openDay": "Monday to Sunday",
            "openTime": "Opens 24/7(Aarti at 6 PM (winter) / 7 PM (summer))",
            "establishYear": "In Ancient Time",
            "fee": "Free",
            "description": "Main bathing ghat and site of the famous evening Ganga Aarti — devotees bath here for ritual purification.",
            "essential": "Visitors to Triveni Ghat are expected to maintain the sanitry of this sacred site by following key rules and regulations. Footwear should be removed before entering the ghat area, and bathing is permitted only in designated zones for safety and hygiene. Littering, spitting, and use of plastic are strictly prohibited to preserve cleanliness and the environment. Loud music, inappropriate behavior, and photography during rituals should be avoided out of respect for religious practices. Alcohol, tobacco, and non-vegetarian food are not allowed. Visitors are encouraged to dress modestly and follow instructions given by local authorities.",
            "story": "Triveni Ghat is revered as the confluence of three sacred rivers—Ganga, Yamuna, and the invisible Saraswati. Mythologically, it is believed Lord Krishna visited here after being struck by a hunter’s arrow. Mentioned in both the Ramayana and Mahabharata, the ghat has served as a site for penance, purification, and ritual for saints and pilgrims for thousands of years.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153486/oeckqwlxdxegqhtxtxax.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153487/bw3fj9ql8takmtfrwzkw.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153488/nieub9npdwmfcnsrorpu.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/pj9Szv0-wgg?si=ckaDUOt9Hebp93Yj"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c78"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Parmarth Niketan Ashram",
            "category": "Spiritual / Yoga Retreat",
            "lat": 30.1192,
            "lon": 78.3124,
            "address": "Near, Main Market Road, Ram Jhula, Swarg Ashram, Rishikesh, Uttarakhand 249304",
            "locationLink": "https://maps.app.goo.gl/fMDxKyfACLfiaPSa9",
            "openDay": "Monday to Sunday ",
            "openTime": "06:00 AM – 08:00 PM (Ganga aarti everyday at 06:00 pm - 07:00 pm (Daily))",
            "establishYear": "1942",
            "fee": "Free",
            "description": "Founded in 1942 by Swami Shukdevanandji Maharaj; largest ashram in Rishikesh, hosts yoga, satsang, Ganga Aarti .",
            "essential": "Visitors to Parmarth Niketan Ashram must observe discipline and spiritual decorum. Silence is encouraged in spiritual areas, especially near temples and during meditation or yoga sessions. Footwear must be removed before entering prayer halls and temples. Alcohol, smoking, tobacco, and non-vegetarian food are strictly prohibited within the ashram premises. Modest clothing is required, and respectful behavior towards monks, staff, and other visitors is expected. Participation in daily activities like Ganga Aarti, yoga, and satsangs is open to all, but punctuality and sincerity are encouraged. Photography is allowed in public areas but should not disturb spiritual practices or ceremonies.",
            "story": "Founded in 1942 by Swami Shukdevanandji Maharaj, Parmarth Niketan has grown into Rishikesh’s largest ashram, offering thousands of rooms and daily spiritual programs. It has hosted spiritual leaders, saints, and international yoga festivals. Its mission focuses on spiritual upliftment, environmental care, and service to humanity.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153491/jpnkomqcy47zrkdwoqwl.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153492/alzdcvkvwlkvbmfwc0yp.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153493/ftkezfx9bovab44roww3.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/Rv1O8NyGG3I?si=VUCI53s66raxs9wV"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c79"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Laxman Jhula & Ram Jhula",
            "category": "Iconic Landmark",
            "lat": 30.1225,
            "lon": 78.315,
            "address": "Swarg Ashram, Rishikesh, Uttarakhand 249304",
            "locationLink": "https://maps.app.goo.gl/Ff6c11vgBoQX2dH37",
            "openDay": "Monday to Sunday",
            "openTime": "Open 24/7 footover bridge access (best visited during daylight for safety and views 5 AM–10 PM)",
            "establishYear": "1929",
            "fee": "Free",
            "description": "Iconic iron suspension bridges linked to Ramayana legend; key spiritual landmarks",
            "essential": "Laxman Jhula and Ram Jhula are pedestrian suspension bridges in Rishikesh that require visitors to follow certain guidelines for safety and respect. Pedestrians should walk on the left side and avoid overcrowding or stopping in the middle for long periods. Two-wheelers are generally restricted, and honking or rash driving (if allowed during certain hours) is prohibited. Littering, spitting, and use of plastic on or near the bridges are strictly banned to maintain cleanliness. Visitors should refrain from feeding monkeys or teasing animals. Loud music, smoking, and inappropriate behavior are not allowed. Respectful dress and demeanor are encouraged as the bridges lead to sacred temples and ashrams.",
            "story": "Laxman Jhula (1939) and Ram Jhula (1986) are iron suspension bridges that connect the spiritual areas of Tapovan, Swarg Ashram, and Muni ki Reti. Legend says Laxman, brother of Lord Rama, crossed the river here on a jute rope. The bridges are surrounded by temples, shops, and ashrams, and symbolize spiritual and cultural unity across the Ganges.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153495/qndqsmstfsqlzy7elkyf.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153496/kxqnwzgiewmiyb0mkvfo.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153497/xcwexiehwma7x3v1rc7z.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/Kfb4rp41-9c?si=3K65qv20GHYY7bDl"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c7a"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Chaurasi Kutia(Beatles Ashram)",
            "category": "Heritage / Meditation Spot",
            "lat": 30.1087,
            "lon": 78.3113,
            "address": "4856+RVP, Swarg Ashram, Rishikesh, Uttarakhand 249304",
            "locationLink": "https://maps.app.goo.gl/8ZiebPJot9KyRGms5",
            "openDay": "Monday to Sunday",
            "openTime": "10:00 AM – 04:00 PM",
            "establishYear": "1961",
            "fee": "₹150 per person",
            "description": "1960s ashram where The Beatles stayed; known for graffiti and spiritual heritage .",
            "essential": "Wear comfortable walking shoes as you’ll explore a large, forested area. Bring a flashlight or use your phone for darker meditation caves. There’s an entry ticket as it lies within Rajaji Tiger Reserve. Avoid littering and follow forest regulations.",
            "story": "Established in the 1960s by Maharishi Mahesh Yogi, the ashram gained global attention when The Beatles stayed here in 1968 to learn Transcendental Meditation. Their stay was musically prolific and spiritually transformative, contributing to the famous “White Album.” The ashram, once abandoned, was reopened by the Forest Department as a heritage site, with murals, huts, and meditation caves still intact.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153500/lpgmcfbne9pfaphbifkh.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153501/llivjrqht5ntfiro6qbo.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153502/ysamrqjdz5fb6qrkod4h.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/zvxtCpb73Bg?si=y5q0g4H4MSB1wTM1"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c7b"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Neer Garh Waterfall",
            "category": "Nature / Waterfall",
            "lat": 30.1465,
            "lon": 78.3402,
            "address": "Neergarh Waterfall Rd, Rishikesh, Kuee, Uttarakhand 249137",
            "locationLink": "https://maps.app.goo.gl/aa5Q5aqkFWXu6ag79",
            "openDay": "Monday to Sunday",
            "openTime": "08:00 AM – 06:00 PM",
            "establishYear": "Not Available",
            "fee": "₹30 per person",
            "description": "Scenic twin waterfalls reached via a short trek; popular for photos & nature trips",
            "essential": "Neer Garh Waterfall, located about 5 km from Laxman Jhula in Rishikesh, requires a short 1–3 km trek through scenic forest paths to reach the beautiful falls. Swimming is allowed in the natural pools, but visitors should be careful as the rocks can be slippery and currents strong. To preserve the environment, littering, use of plastic, and loud music are strictly prohibited. The best time to visit is from September to March, while the monsoon season should be avoided due to slippery trails and the risk of landslides.",
            "story": "Tucked into a forested cliffside, Neer Garh (or Neer Gaddu) waterfall is a natural spring-fed fall. It gained tourist popularity in recent years for its serene setting and accessibility. Though not tied to ancient history, it complements Rishikesh's natural charm and is a favorite among nature lovers and photographers.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153505/mfwlzwinxk31miq9lh1u.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153506/dczidebawhmxoreh6hz4.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153507/yyyr9lk0u49oafysjmdt.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/m41FahMG7jE?si=PzUs0QUJuEX7tXkl"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c7c"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Tapovan",
            "category": "Spiritual / Yoga Area",
            "lat": 30.1302,
            "lon": 78.324,
            "address": "Rishikesh, Uttarakhand 249192",
            "locationLink": "https://maps.app.goo.gl/1wxd4oFFV22LU3R28",
            "openDay": "Monday to Sunday",
            "openTime": "Opens 24 hours (Open freely; no formal gate/ticket)",
            "establishYear": "Early 20th Centuries",
            "fee": "Free",
            "description": "Valley area known for its yoga schools and serene riverbank retreats; upcoming ropeway to Kunjapuri .",
            "essential": "Tapovan, located near Laxman Jhula in Rishikesh, is a peaceful spiritual area known for ashrams, yoga centers, and meditation retreats. It’s a place for quiet reflection, so visitors are expected to maintain silence in many areas, especially during classes or prayers. Loud music, alcohol, smoking, and non-vegetarian food are strictly prohibited. Modest clothing and respectful behavior are required, especially in ashrams and temples. Photography may be restricted in some spiritual spaces. Cleanliness is important—no littering or use of plastic is allowed. Tapovan encourages a calm, mindful atmosphere ideal for those seeking spiritual growth or inner peace.",
            "story": "In Sanskrit, “Tapovan” means “forest of penance.” Legends say sages like Vishwamitra and Dronacharya meditated here. Today, Tapovan blends modern yoga centers with ancient spiritual roots, making it a retreat for seekers from all over the world.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153510/iozrwe4dfegoyj4elbg9.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153512/wunu31drlxgdf4mfi92g.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153515/ioaz6aplja6mac4ksiql.jpg"
            ],
            "videos": [
                "www.youtube.com/embed/NHNLlLYchjU?si=Yk8kFtHiUQk4ao3H"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c7d"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Rishikesh Market ",
            "category": "Local Shopping / Market",
            "lat": 30.1083,
            "lon": 78.2972,
            "address": "4842+Q4R, Manvendera Nagar, Rishikesh, Uttarakhand 249201",
            "locationLink": "https://maps.app.goo.gl/ysZ2fhEVcpUrBshc8",
            "openDay": "Monday to Sunday, Some shops may be closed on Tuesday",
            "openTime": "9:00 AM–9:00 PM (varies by shop)",
            "establishYear": "Not Available",
            "fee": "Free",
            "description": "Bustling bazaar selling spiritual items, handicrafts, clothing & snacks.",
            "essential": "Carry cash for small shops; many sell unique handicrafts, rudraksha beads, and yoga gear. Bargain respectfully and explore side lanes for hidden treasures.",
            "story": "The markets evolved around temples and ashrams, originally catering to pilgrims. Over time, with the rise of spiritual tourism and yoga popularity, stalls expanded to offer meditation gear, organic goods, and even Western fusion clothing, creating a blend of tradition and modernity.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153517/kgfkmii7ygmk7ynt4yes.webp",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153518/of8kmeck7ah3rdmfteez.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153519/o1cqcwcrhfp5qzdlquwd.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/sxYslG9aZ_A?si=HSEwolXZkv1vjJsz"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c7e"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Patna Waterfall",
            "category": "Nature / Waterfall",
            "lat": 30.1031,
            "lon": 78.2947,
            "address": "4978+V22, Patna, Uttarakhand 249302",
            "locationLink": "https://maps.app.goo.gl/XCuZ3X7oERFfQsXT9",
            "openDay": "Monday to Sunday",
            "openTime": "08:00 AM – 06:00 PM (Best visited in daylight)",
            "establishYear": "In Ancient Time",
            "fee": "Free",
            "description": "Offbeat waterfall accessible via light trek; less crowded and peaceful.",
            "essential": "Patna Waterfall is a scenic and peaceful spot located about 6–7 km from Laxman Jhula, accessed by a 1.5 km forest trek starting near Garud Chatti on the Neelkanth Temple road. The trail passes through parts of the Rajaji forest and is relatively easy, though proper shoes and water are recommended. Visitors can enjoy a dip in the small natural pool, but caution is needed as rocks may be slippery. There’s no entry fee, and small stalls selling tea or snacks may be found near the starting point. The best time to visit is after the monsoon or in winter, as the waterfall may dry up in summer or overflow during heavy rains.",
            "story": "Unlike Neer Garh, Patna Waterfall is more secluded and lesser known. It's named after a nearby Patna village. While it holds no ancient mythological ties, its untouched beauty has made it a favorite among trekkers and meditation enthusiasts.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153522/wlumnnstmb6gkjnnwge1.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153523/wmpdwmx59jv4h4g1iyiu.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153525/e7uvcybmfvnzj3ek2eos.webp"
            ],
            "videos": [
                "https://www.youtube.com/embed/siMa802eUdg?si=quqnqCsilXKssIxZ"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c7f"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Trimbakeshwar Temple",
            "category": "Religious Temple",
            "lat": 30.1266,
            "lon": 78.329,
            "address": "Shiv chowk, near trimbakeshwar temple, Laxman Jhula, Rishikesh, Uttarakhand 249302",
            "locationLink": "https://maps.app.goo.gl/DdZuacHA2WfoVvTC7",
            "openDay": "Monday to Sunday",
            "openTime": "06:00 AM – 12:00 PM, 02:00 PM – 07:00 PM (Reopens)",
            "establishYear": "9th CE",
            "fee": "Free",
            "description": "Multi-story Rama temple near Laxman Jhula; ancient religious site.",
            "essential": "Trimbakeshwar Temple, also known as the 13-storey Tera Manzil Temple, is a prominent spiritual site located near Laxman Jhula in Rishikesh. As a sacred Hindu temple, visitors are expected to dress modestly and behave respectfully. Footwear must be removed before entering the inner sanctum. Photography may be restricted in certain areas, especially around idols. Smoking, alcohol, and non-vegetarian food are strictly prohibited on temple premises. Silence or low voices are encouraged inside, especially during prayer times. Devotees and tourists should also avoid littering and follow cleanliness norms, maintaining the sanctity and peaceful atmosphere of the temple.",
            "story": "This 13-story temple is dedicated to Lord Shiva and houses multiple deities on each floor. It is modeled after the original Trimbakeshwar Jyotirlinga in Nashik. Built in the 20th century, it's now one of Rishikesh’s most visited spiritual landmarks.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153529/hrf4kiff1nopkolq0whz.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153530/akixvmq1lye6nxzmoq3z.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153532/ss85nlrokfeizndz6tvv.jpg"
            ],
            "videos": [
                "www.youtube.com/embed/Q_Yv0y009NU?si=qnL3IdR3zx98QqWS"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c80"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Bharat Mandir",
            "category": "Religious Temple",
            "lat": 30.1031,
            "lon": 78.2947,
            "address": "9, Ghat Rd, Mayakund, Rishikesh, Uttarakhand 249201",
            "locationLink": "https://maps.app.goo.gl/mWAGLss16iYpreuW8",
            "openDay": "Monday to Sunday",
            "openTime": "05:00 AM – 12:00 PM, 04:00 PM – 09:00 PM",
            "establishYear": "1921",
            "fee": "Free",
            "description": "One of India’s oldest temples, attributed to Adi Shankaracharya; tourist and spiritual significance.",
            "essential": "Bharat Mandir, one of the oldest temples in Rishikesh, venerates Lord Hrishikesh Narayan and holds deep spiritual significance. Entry is free, and the temple operates in two daily time slots. Visitors should dress modestly, remove footwear before entering, and maintain decorum by avoiding loud conversations, smoking, alcohol, and non-vegetarian food. Photography may be restricted inside the inner sanctum. Daily rituals include aarti ceremonies and special events like Basant Panchami and Akshaya Tritiya, when taking 108 parikramas around the deity is believed to fulfill wishes. The temple complex also hosts ancient sacred trees and a small museum displaying artifacts unearthed on site",
            "story": "Thought to be the oldest temple in Rishikesh, it is said to have been established by Adi Shankaracharya in the 8th century. Dedicated to Lord Vishnu (Bharat form), it houses a rare black stone idol made of Shaligram, unearthed from the Alaknanda River.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153534/bfuzgycgkjoqpoizb2pd.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153536/qgans5zoaicsx66pnnkr.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153537/bibgj9svthgizpaacpbl.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/FNiEG_FZovA?si=uTX_AlPaOqXxd-k9"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c81"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Garud Chatti Waterfall",
            "category": "Nature / Waterfall",
            "lat": 30.1228,
            "lon": 78.3526,
            "address": "49F3+QR9, Patna, Uttarakhand 249302",
            "locationLink": "https://maps.app.goo.gl/5fdkzKQqdFGMyvyn7",
            "openDay": "Monday to Sunday",
            "openTime": "08:00 AM – 06:00 PM(Natural open 24 hrs)",
            "establishYear": "In Ancient Time",
            "fee": "Free",
            "description": "Small waterfall near Neelkanth highway; short, easy trek.",
            "essential": "Garud Chatti Waterfall, located near the Neelkanth Mahadev Road and about 4–5 km from Laxman Jhula, is a serene natural spot accessible via a short forest trek. The path is rocky and slightly steep, so good footwear and water are recommended. Swimming in the natural pools is allowed but should be done cautiously, as rocks can be slippery. To preserve the peaceful and eco-friendly environment, littering, use of plastic, loud music, smoking, and alcohol are strictly prohibited. Modest clothing and respectful behavior are expected, especially since the area is close to spiritual sites. Best time to visit is post-monsoon when the water flow is strong.",
            "story": "Named after Garud (the eagle vehicle of Lord Vishnu), the falls are serene and ideal for a short nature break. Locals consider the area sacred, and it’s often used by small spiritual groups for chanting and solitude.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153541/k2noqlk5m5xcwmxzgbwu.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153544/evybwwquyf6stieyjsgn.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153545/wbdfn56plqf8kzyimb7q.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/GnP2PrT9f5s?si=CNmBs5vTTSReWT9O"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c82"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Haridwar ",
            "category": "City places ",
            "lat": 29.9457,
            "lon": 78.1642,
            "address": "Haridwar main city,Uttrakhand,India",
            "locationLink": "https://www.google.com/maps/place/Haridwar, +Uttarakhand/@29.9526242, 78.0335242, 24146m/data=!3m2!1e3!4b1!4m6!3m5!1s0x3909470eb8ee57c9:0x4e449176a640f5f3!8m2!3d29.9456906!4d78.1642478!16zL20vMDFxNnJi?entry=ttu&g_ep=EgoyMDI1MDYxNy4wIKXMDSoASAFQAw%3D%3D",
            "openDay": "Monday to Sunday",
            "openTime": "Opens 24/7",
            "establishYear": "Vedic period (around 3,000+ years ago).",
            "fee": "Free",
            "description": "Haridwar is one of the seven holiest cities (Sapta Puri) in Hinduism. It is the place where the Ganga River enters the plains of North India from the Himalayas. The city is known for its Ganga Aarti, ancient temples, and spiritual energy.",
            "essential": "Visiting Haridwar is a deeply spiritual experience, but a few essential tips can help make your trip smooth and meaningful. Dress modestly and respectfully, as most places are active temples or sacred ghats. Attend the Ganga Aarti at Har Ki Pauri in the evening — arrive early (by 5:30 PM) to get a good spot and experience the soulful atmosphere. Be cautious around the ghats; the river current is strong, so avoid swimming unless guided. Opt for registered e-rickshaws or autos to travel around the city affordably. Carry cash, as smaller shops and local eateries may not accept cards. If visiting Mansa Devi or Chandi Devi, consider buying a ropeway combo ticket to save time and effort. Also, avoid non-vegetarian food and alcohol during your stay — Haridwar is a devout vegetarian city. Finally, be respectful of local customs, don’t photograph people during rituals without permission, and keep the ghats clean.",
            "story": "According to Hindu mythology, Haridwar (meaning \"Gateway to Lord Vishnu\") is one of the four cities where drops of Amrit (elixir of immortality) fell during the Samudra Manthan (churning of the ocean). These drops made the city spiritually charged and gave rise to the Kumbh Mela, which occurs every 12 years. Haridwar has been a gateway to the Char Dham Yatra (Gangotri, Yamunotri, Kedarnath, Badrinath) for centuries.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153547/jcusjul9ffdkwagwh9dj.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153548/nhelxwmhspnq03cjkvdj.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153549/oduxdu5rxuoeq15iaucs.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/i2oYiFabX-o?si=TUh5km_-joKe-9W-"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c83"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Neelkanth Mahadev Temple",
            "category": "Religious Temple",
            "lat": 30.0811,
            "lon": 78.3405,
            "address": "38JR+C6G, Kotdwar - Pauri Rd, Kotdwar, Uttarakhand 246149",
            "locationLink": "https://maps.app.goo.gl/p87zPNzBaFaNQQ3ZA",
            "openDay": "Monday to Sunday",
            "openTime": "06:00 AM – 09:00 PM",
            "establishYear": "At the time of Samudra Manthan",
            "fee": "Free",
            "description": "Shiva temple at confluence of rivers, tied to myth of Shiva consuming poison; dense forest setting .",
            "essential": "At Neelkanth Mahadev Temple, visitors must respect the religious sanctity by adhering to certain rules. Footwear must be removed before entering the temple premises. Devotees should dress modestly and maintain a peaceful and respectful demeanor. Alcohol, tobacco, and non-vegetarian food are strictly prohibited in and around the temple. Photography inside the sanctum is generally not allowed and should be avoided unless permitted. During peak pilgrimage times, crowd control rules and queue systems must be followed. Offerings like water, milk, and bilva leaves are allowed, but littering and plastic use are strictly banned to preserve the natural and spiritual environment.",
            "story": "The Neelkanth Mahadev Temple, located near Rishikesh amidst the dense forests of the Rajaji National Park, is steeped in Hindu mythology and marks the sacred spot where Lord Shiva is believed to have consumed the deadly poison Halahala that emerged from the churning of the cosmic ocean (Samudra Manthan) by gods and demons in their quest for the nectar of immortality. To save the universe, Shiva drank the poison, which turned his throat blue, earning him the name “Neelkanth” (the blue-throated one). The surrounding forest, now protected as Rajaji National Park, has long been considered a spiritual Tapovan (forest of penance), where sages meditated and divine events are said to have unfolded, making the entire region a deeply revered site for pilgrims and nature lovers alike.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153552/jxc8ieq4eurwenu1xrta.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153553/rz3e66se1jecvbofx1sr.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153555/cpab90bb1na8uvoxjyd1.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/GBOR853PDiY?si=r8KDYKi0oqeh-_tM"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c84"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Rajaji National Park",
            "category": "Wildlife / Nature Park",
            "lat": 30.0155,
            "lon": 78.1524,
            "address": "Uttarakhand",
            "locationLink": "https://maps.app.goo.gl/r9X85JXDeMAZFTCX7",
            "openDay": "Monday to Sunday (Open from November 15 to June 15; closed during monsoon (June 16 to Nov 14) for wildlife protection and track maintenance.)",
            "openTime": "06:00 AM – 09:00 AM, 03:00 PM – 06:00 PM (Jeep safari slots)",
            "establishYear": "1983",
            "fee": "₹150 per person",
            "description": "Wildlife sanctuary home to elephants, tigers, leopards; forest safaris twice daily .",
            "essential": "Visitors to Rajaji National Park must follow certain rules to ensure safety and protect wildlife. Entry is allowed only during daylight hours with a valid permit and ID, and staying inside the vehicle is mandatory during safaris. Loud noise, music, teasing, or feeding animals is strictly prohibited. Driving must be slow and only on marked routes. Littering, use of plastic, smoking, and open fires are banned to prevent harm to the forest. Wearing dull-colored clothes and avoiding strong perfumes is advised. Flash photography is not allowed, and any kind of hunting equipment, sharp objects, or harmful items are forbidden. These rules help keep the park safe and peaceful for both visitors and animals.",
            "story": "Rajaji National Park, nestled in the Shivalik ranges near Haridwar and Rishikesh, is not only a haven for rich biodiversity but also holds deep cultural and spiritual significance, as its forests have long been considered sacred Tapovans where ancient sages meditated and legends say Lord Shiva himself wandered. The park, named after C. Rajagopalachari (Rajaji), India’s first Indian Governor-General, was established in 1983 by merging three sanctuaries—Rajaji, Motichur, and Chilla—and is home to elephants, tigers, leopards, and hundreds of bird species. With its blend of mythological reverence and ecological richness, the park offers a unique harmony of spirituality, wildlife, and natural beauty, deeply rooted in India’s cultural and environmental heritage.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153557/zvtpebmclveh8rqhosnw.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153558/yzh6aiypjj6d5dolggnx.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153559/lobf7pjpgqwaajojmoym.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/nFtFqR885ps?si=W6UJhMGrwDdxXjOi"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c85"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Kunjapuri Devi Temple",
            "category": "Religious Temple",
            "lat": 30.1742,
            "lon": 78.314,
            "address": "58F7+JM9, Adali, Uttarakhand 249175",
            "locationLink": "https://maps.app.goo.gl/X1pxBywQGMxfBdCy5",
            "openDay": "Monday to Sunday",
            "openTime": "06:00 AM – 07:00 PM",
            "establishYear": "8th CE",
            "fee": "Free",
            "description": "Hilltop Devi temple offering sunrise views; highly revered for blessings.",
            "essential": "Kunjapuri Devi Temple, located on a hilltop near Rishikesh, is a sacred Shaktipeeth that requires a climb of around 80 steps or a trek through forest trails. Visitors should be prepared for steep paths and high altitude, making comfortable shoes and water important. Photography is generally allowed, but respectful behavior and modest clothing are expected at this holy site. Littering, smoking, and loud behavior are not permitted. Aarti rituals are held daily, and the temple becomes especially crowded during festivals like Navratri and Dussehra. Many visitors arrive early in the morning to witness the peaceful and scenic sunrise.",
            "story": "One of the 52 Shakti Peethas, this temple is dedicated to Goddess Durga and is believed to be where her upper body fell during the legend of Sati. Kunjapuri has been a pilgrimage site for centuries and is also a key point in the spiritual triangle with Surkanda Devi and Chandrabadni temples.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153562/ibc1h9ridbu8f51iemn8.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153564/v4yhznn6hjriccuhuheh.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153565/qk6zse58o0lkerpiskld.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/FuusjIL52ks?si=9wrnAuO9pXsxyrgR"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c86"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Vashistha Gufa",
            "category": "Meditation Spot",
            "lat": 30.1144,
            "lon": 78.432,
            "address": "4C7J+PR3, Haridwar Rishikesh Badrinath Rd, Shivpuri Range, Uttarakhand 249192",
            "locationLink": "https://maps.app.goo.gl/uXKp4eTbfTEf2pFb7",
            "openDay": "Monday to Sunday",
            "openTime": "06:00 AM – 06:00 PM(Dawn–dusk)",
            "establishYear": "1930",
            "fee": "Free",
            "description": "Meditation cave associated with sage Vashistha; used for silent spiritual practice.",
            "essential": "Vashishta Gufa is a peaceful cave near Shivpuri where sage Vashishta is believed to have meditated. Visitors must descend around 200 stone steps to reach the cave by the Ganga River. Silence is highly respected inside the cave, as it's a meditation spot, and photography is generally not allowed. Shoes must be removed before entering, and visitors should wear modest clothing. Smoking, loud noises, and use of plastic are strictly prohibited. The cave has limited lighting, so carrying a small flashlight is helpful. The area is open only during fixed hours, usually in the morning and late afternoon, and remains closed during midday.",
            "story": "The cave is believed to have been the meditation site of sage Vashistha, one of the Saptarishis (seven sages). The atmosphere inside the cave remains cool and calm year-round, drawing serious meditators and spiritual seekers.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153567/dh8vlkxt0z3lwtgnf0xu.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153569/lbtlmvtnlq1b8imoq0pn.jpg",
                "162)",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153570/akogxim9vjf18qfz6hua.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/I-X5-t4PmFw?si=fbw4wcNa08Tg8tnQ"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c87"
        },
        {
            "cityId": "68a57ac9fe74fcba8502d52b",
            "cityName": "Rishikesh",
            "places": "Shivpuri",
            "category": "Adventure Sports Hub",
            "lat": 30.1351,
            "lon": 78.3893,
            "address": "49PQ+PP8, Shivpuri, Dhunar Gaon, Uttarakhand 249192",
            "locationLink": "https://maps.app.goo.gl/Wrpx1a7uzPvXnF4q7",
            "openDay": "Monday to Sunday( Open from mid-September to early June; closed during monsoon (mid-June to mid-September) due to high river flow and safety regulations.)",
            "openTime": "7:00–8:00 AM to 4:00 PM (Adventure activities have fixed slots)",
            "establishYear": "Not Available",
            "fee": "Free",
            "description": "Major adventure hub offering river rafting, camping, bungee; rafting grades II‑III+",
            "essential": "Ideal for river rafting, bungee jumping, and camping. Wear light, quick-dry clothing and ensure you follow safety instructions from certified adventure operators. Best time to visit is from mid-September to early June.",
            "story": "Once a quiet forest region, Shivpuri (meaning \"City of Lord Shiva\") transformed into an adventure hub over the past two decades. Its location on the Ganges, with naturally strong currents, made it perfect for rafting, which was introduced in the 1990s. Despite modernization, it retains a peaceful spiritual vibe outside adventure zones.",
            "images": [
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153572/wzapbqptvghkwutjpqvk.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153573/jrrdpjwfltitionwk1x1.jpg",
                "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757153574/lqheorcdhn3shstdwaf9.jpg"
            ],
            "videos": [
                "https://www.youtube.com/embed/0ujg11IoYvM?si=_PZKc9Y9oFSFnV6H"
            ],
            "premium": "FREE",
            "_id": "68c7f5f720f4dc4834768c88"
        }
    ]
}