{
    "Places-to-visit": [
        {
            "places ": "Kashi Vishwanath Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.3109° N,83.0107° E",
            "address": "Lahori Tola, Varanasi, Domari, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/pRotzxDAAvcsSUTP8",
            "open-day": "Monday to Sunday",
            "open-time": "03:00AM - 11:00PM",
            "guide-availiblity": "Yes (Govt & private)",
            "establish-year": 1780,
            "fee": "Entry: Free | VIP Darshan: ₹300–₹500 | Guide: ₹200–₹500",
            "description": "One of the twelve Jyotirlingas of Lord Shiva, Kashi Vishwanath Temple is a significant pilgrimage site for Hindus. Located on the western bank of the Ganges, it has a rich historical and spiritual legacy. The temple's gold-plated spires and the holy well of Gyan Vapi attract millions of devotees seeking blessings and liberation (Moksha). The spiritual aura and chants create an enchanting atmosphere.",
            "essential": "Footwear, mobile phones, cameras, and other electronic items are strictly prohibited. Security checks are mandatory. Offerings are allowed but should be purchased from authorized vendors.",
            "story": "The Kashi Vishwanath Temple, located in the ancient city of Varanasi on the banks of the sacred Ganga River, is one of the most revered shrines dedicated to Lord Shiva, known here as Vishwanath, the “Lord of the Universe.” It is one of the twelve Jyotirlingas, the holiest Shiva shrines in India. The temple has a long and turbulent history—originally built in ancient times, it was destroyed and rebuilt multiple times by various rulers. The current structure was reconstructed in 1780 by Ahilyabai Holkar, the Maratha queen of Indore. The temple’s gold-plated spires and sanctum sanctorum radiate spiritual energy, drawing millions of pilgrims each year who believe that worshipping here grants moksha (liberation from the cycle of rebirth). Surrounded by narrow alleys of Varanasi and immersed in the sound of bells and chants, Kashi Vishwanath stands as a timeless symbol of faith, resilience, and divine presence.",
            "image0": "https://i.pinimg.com/474x/58/f2/e5/58f2e5965356a002dd90e8ce15a447de.jpg",
            "image1": "https://i.pinimg.com/474x/8c/df/4d/8cdf4d168c56b3cafbb7d45e9af3eec6.jpg",
            "image2": "https://i.pinimg.com/474x/bf/60/88/bf60886c58e4ffd17540c7f8e4f5d583.jpg",
            "video": "https://www.youtube.com/embed/NkwxaZpuNQM?si=jqAZeydxwmVL76md"
        },
        {
            "places ": "Baba Kal Bhairav Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.3176° N,83.0159° E",
            "address": "Pandeypur Rd, Golghar, Naibasti, Varanasi, Uttar Pradesh 221002",
            "location-link": "https://maps.app.goo.gl/utA8bp8pf5ywZTzp9",
            "open-day": "Monday to Sunday",
            "open-time": "05:30AM - 10:30PM",
            "guide-availiblity": "Yes (limited)",
            "establish-year": "In ancient times",
            "fee": "Entry: Free | Offerings: ₹100–₹200 | Guide: ₹150–₹300",
            "description": "Dedicated to Kal Bhairav, the guardian deity of Varanasi, this ancient temple holds immense religious significance. It is believed that no one can stay in Varanasi without Kal Bhairav's permission. Devotees offer alcohol as a ritual, reflecting the unique tradition. The temple's historical architecture and spiritual importance make it a must-visit for pilgrims and tourists alike.",
            "essential": "Footwear removal is required. Photography inside the sanctum is prohibited. Offerings should be bought from authorized vendors.",
            "story": "The Baba Kal Bhairav Temple in Varanasi is one of the city's oldest and most fearsome shrines, deeply rooted in Hindu mythology and Shaivite traditions. The legend behind the temple begins when Lord Shiva, angered by Brahma's arrogance, created Kal Bhairav, a fierce form of himself, to punish Brahma. Kal Bhairav severed one of Brahma’s five heads, committing the grave sin of Brahmahatya (killing a Brahmin). Cursed, he was forced to wander with Brahma’s skull (kapala) stuck to his hand as a begging bowl. It was only when he entered Kashi (Varanasi) that the curse broke—the skull fell from his hand, and his sin was absolved. This sacred event established Varanasi as a land beyond sin, and Shiva appointed Kal Bhairav as the eternal guardian (Kotwal) of the city. Since then, it is believed that even death cannot enter Kashi without Kal Bhairav's permission, and every resident or visitor must seek his blessing to safely stay in the holy city. The temple has stood as a powerful symbol of protection, justice, and divine authority for centuries, visited by saints, kings, and devotees alike.",
            "image0": "https://i.pinimg.com/474x/44/1d/56/441d56fdfe0ee535aa480a9368b124d5.jpg",
            "image1": "https://i.pinimg.com/474x/26/29/c7/2629c7dfe04e7aa31a3b9b05a9652019.jpg",
            "image2": "https://i.pinimg.com/474x/95/3a/80/953a80979cc2fd24ee023c0df914d1b2.jpg",
            "video": "https://www.youtube.com/embed/--dvqcAEszY?si=Gv6JyCWs4UQMsQNk"
        },
        {
            "places ": "Sarnath",
            "category": "Iconic Landmark / Heritage Spot",
            "lat-lon": "25.3716° N,83.0252° E",
            "address": "Sarnath, Varanasi, Uttar Pradesh 221007, India",
            "location-link": "https://maps.app.goo.gl/tydKeXUELLifVMug6",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "Yes (Well organized)",
            "establish-year": "3rd century",
            "fee": "Entry: ₹25 (Indian), ₹300 (Foreigner), Museum ₹20 | Guide: ₹300–₹600",
            "description": "Sarnath is a revered Buddhist pilgrimage site where Lord Buddha delivered his first sermon. It houses ancient stupas, the iconic Ashoka Pillar, and the Dhamek Stupa. The Sarnath Archaeological Museum displays artifacts from the Mauryan era. The peaceful surroundings, lush gardens, and spiritual significance make Sarnath a serene retreat for visitors interested in history and spirituality.",
            "essential": "Maintain respectful behavior as it is a significant Buddhist site. Photography is allowed in most areas but restricted inside the museum. An entry fee is applicable for the museum.",
            "story": "Sarnath, located about 10 km from Varanasi, is one of the holiest Buddhist sites in the world. It is the place where Gautama Buddha gave his first sermon after attaining enlightenment in Bodh Gaya around 528 BCE. This event, known as Dharmachakra Pravartan (Turning of the Wheel of Dharma), marked the beginning of the Buddhist Sangha (monastic community). At Sarnath, Buddha preached to his first five disciples, laying the foundation of his teachings—the Four Noble Truths and the Eightfold Path. Over time, Sarnath grew into a major center of Buddhist learning, supported by Mauryan Emperor Ashoka, who erected a massive stone pillar with his edict and built several stupas and monasteries. The Dhamek Stupa, still standing today, marks the exact spot of the first sermon. Sarnath flourished for centuries until it was destroyed by invaders in the 12th century. Rediscovered in the 19th century through archaeological excavations, Sarnath is now a serene pilgrimage site and a symbol of peace, enlightenment, and the global spread of Buddhism.",
            "image0": "https://i.pinimg.com/474x/2d/8d/32/2d8d321788a4634b17da1d768c031264.jpg",
            "image1": "https://i.pinimg.com/474x/1e/e2/24/1ee224164b5c4bf9e15dd407ddd5b08e.jpg",
            "image2": "https://i.pinimg.com/474x/95/3a/80/953a80979cc2fd24ee023c0df914d1b2.jpg",
            "video": "https://www.youtube.com/embed/lMwlpPJPfUI?si=Kaf0Wy60kHEGYv1a"
        },
        {
            "places ": "Tulsi Manas Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.3186° N,82.9879° E",
            "address": "Sankat Mochan Rd, Durgakund Rd, near Jalan, Varanasi, Uttar Pradesh 221005",
            "location-link": "https://maps.app.goo.gl/pktu56DZ2GdRsZ2TA",
            "open-day": "Monday to Sunday",
            "open-time": "05:30AM - 09:00PM",
            "guide-availiblity": "Yes (optional)",
            "establish-year": 1964,
            "fee": "Entry: Free | Guide: ₹100–₹200",
            "description": "Tulsi Manas Temple is dedicated to Lord Rama and commemorates the place where Tulsidas composed the Ramcharitmanas. Built in white marble, the temple walls are inscribed with verses from the epic. It is known for its serene ambiance and cultural significance. The temple also features dioramas depicting scenes from Ramayana, making it an educational and spiritual destination for visitors.",
            "essential": "Footwear is to be removed before entry. Photography is generally allowed, but it's best to confirm on-site. Silence and modesty are expected inside the temple.",
            "story": "The Tulsi Manas Temple in Varanasi is a revered shrine dedicated to Lord Rama and holds immense literary and cultural significance in Hinduism. Built in 1964 by the Birla family, the temple stands at the very place where the great saint-poet Goswami Tulsidas is believed to have composed the Ramcharitmanas, a retelling of the Sanskrit Ramayana in Awadhi, the language of the common people. This epic made the story of Lord Rama accessible to millions and became a spiritual and cultural cornerstone of North India. The temple, made of white marble, has the verses and scenes from the Ramcharitmanas inscribed on its walls, creating a sacred atmosphere that honors both devotion and literary heritage. It serves not just as a place of worship, but also as a tribute to the power of vernacular literature in spreading spiritual wisdom, making it a must-visit for devotees, scholars, and tourists alike.",
            "image0": "https://i.pinimg.com/736x/eb/86/08/eb86089671bae13112f53f40e36d86bb.jpg",
            "image1": "https://i.pinimg.com/474x/01/5f/07/015f0731df7d51b607ae96ccf48edb88.jpg",
            "image2": "https://i.pinimg.com/474x/db/8a/74/db8a74fda2ef83d3599a26f706d9cab9.jpg",
            "video": "https://www.youtube.com/embed/v4YbgqETgOk?si=JsrGQPNvO-QPpc0F"
        },
        {
            "places ": "Durga Kund Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.2887° N,82.9991° E",
            "address": "7XRR+WVR, Khojwan Rd, Near Gandhi Chowk, Khojwan, Bhelupur, Varanasi, Uttar Pradesh 221010",
            "location-link": "https://maps.app.goo.gl/wLpcdvDXxjQQtstd9",
            "open-day": "Monday to Sunday",
            "open-time": "05:30AM - 09:00PM",
            "guide-availiblity": "Yes (optional)",
            "establish-year": "18th century",
            "fee": "Entry: Free | Puja ₹50–₹100 | Guide: ₹100–₹200",
            "description": "Dedicated to Goddess Durga, Durga Kund Temple is known for its bright red color and Nagara-style architecture. It is situated beside a rectangular pond (kund) and is believed to be self-manifested. The temple attracts devotees, especially during Navratri, for its spiritual aura and cultural importance. The serene pond and intricate carvings make it a picturesque and peaceful site for visitors.",
            "essential": "Footwear removal is mandatory. Photography may be restricted during certain rituals. Maintaining silence and respecting the local customs is expected.",
            "story": "The Durga Kund Temple is an ancient and revered Hindu temple located in Varanasi, dedicated to Goddess Durga, the powerful deity of strength, protection, and motherhood. The temple is situated near the Durga Kund (Durga Pond), which is believed to be one of the sacred water bodies of the city. It is said to have been established by the Kashmiri King, Raja Kesar Singh, during the reign of the Mughal Empire. According to local legend, the temple was originally constructed by Lord Vishnu to honor Goddess Durga, and over time, it has become a major place of worship, especially during the Navratri festival, when thousands of devotees visit to offer their prayers and seek blessings for strength and protection. The idol of Durga in the temple is beautifully crafted, and the temple’s serene surroundings make it a peaceful retreat for both spiritual seekers and pilgrims. It remains a major pilgrimage spot, symbolizing the victory of good over evil.",
            "image0": "https://i.pinimg.com/474x/9a/fc/ff/9afcff8fc90c34cf84bbf3470291eb40.jpg",
            "image1": "https://i.pinimg.com/474x/2c/b2/61/2cb2619365cd92a2d3fa4b77e7421f17.jpg",
            "image2": "https://i.pinimg.com/474x/40/3f/aa/403faa36b3694096f71baa340b364918.jpg",
            "video": "https://www.youtube.com/embed/7-3YxZcfG3M?si=PJDbvY57KukK2kKK"
        },
        {
            "places ": "Sankat Mochan Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.2829° N,83.0002° E",
            "address": "Saket Nagar Colony, Sankata Mochan Leprosy, Varanasi, Uttar Pradesh 221005",
            "location-link": "https://maps.app.goo.gl/7to4RtKu3esyMs3WA",
            "open-day": "Monday to Sunday",
            "open-time": "05:00AM - 10:00PM",
            "guide-availiblity": "Yes(Limited)",
            "establish-year": "16th century",
            "fee": "Entry: Free | Puja ₹50–₹150 | Guide: ₹100–₹200",
            "description": "Sankat Mochan Temple is dedicated to Lord Hanuman, known as the remover of obstacles. Established by poet-saint Tulsidas, the temple is a significant site for devotees seeking blessings for courage and protection. The continuous chanting of Hanuman Chalisa creates a spiritual ambiance. Tuesdays and Saturdays witness heavy footfall, reflecting the strong cultural and religious faith associated with Hanuman worship.",
            "essential": "Footwear must be removed before entry. Large bags and electronic devices might be restricted due to security reasons. Silence and respect for ongoing prayers are expected.",
            "story": "The Sankat Mochan Temple in Varanasi is one of the most revered temples dedicated to Lord Hanuman, the Hindu deity known for his strength, devotion, and courage. The temple, founded by the famous Indian freedom fighter and saint Pandit Madan Mohan Malviya in 1900, stands near the banks of the Assi River. The name \"Sankat Mochan\" translates to \"Reliever of Troubles,\" and devotees believe that by praying here, their difficulties, misfortunes, and ailments are alleviated by the divine grace of Hanuman. According to legend, the temple is situated at the spot where Hanuman is said to have appeared and removed the suffering of the local population. The idol of Hanuman in the temple is a large, striking image, and the temple's serene environment makes it a significant place for both worship and meditation. During Hanuman Jayanti and other festivals, the temple sees huge crowds, and it remains one of the spiritual pillars of the city.",
            "image0": "https://i.pinimg.com/474x/a8/6e/7d/a86e7db806a350e5582a14f320bfdcab.jpg",
            "image1": "https://i.pinimg.com/474x/20/e9/49/20e9490f26293d7d93ee9f6e71985515.jpg",
            "image2": "https://i.pinimg.com/474x/bf/d9/8b/bfd98bf9bed724844bd4ca5b96b5cb5a.jpg",
            "video": "https://www.youtube.com/embed/-2hWUaTnoaM?si=DRCtR0wUywuG3USd"
        },
        {
            "places ": "Annapurna Devi Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.3104° N,83.0101° E",
            "address": "D 9, Annapurna Math Mandir, 1, Vishwanath Galli, Godowlia, Varanasi, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/Rp2JkkPgdYYwj8Tv6",
            "open-day": "Monday to Sunday",
            "open-time": "04:00AM - 11:00PM",
            "guide-availiblity": "Yes(Often clubbed with KVT)",
            "establish-year": "18th century",
            "fee": "Entry: Free | Bhog ₹50 | Guide: ₹100–₹200",
            "description": "Annapurna Devi Temple is dedicated to Goddess Annapurna, the deity of nourishment. It is believed that worshiping here ensures food security and prosperity. The temple's golden idol of the goddess is adorned with rich ornaments. It is located near the Kashi Vishwanath Temple, making it an important pilgrimage site. The temple's spiritual ambiance and cultural heritage attract numerous devotees.",
            "essential": "Standard temple rules apply, including footwear removal. Photography policies should be confirmed on-site. Silence and modest behavior are expected.",
            "story": "The Annapurna Devi Temple, located near the Kashi Vishwanath Temple in Varanasi, is dedicated to Goddess Annapurna, the Hindu goddess of food and nourishment, and an incarnation of Parvati, the consort of Lord Shiva. The temple’s origins are deeply rooted in a powerful legend: according to Hindu mythology, Lord Shiva once declared that the world is an illusion and that food is unimportant. To teach him the value of nourishment, Goddess Parvati appeared as Annapurna and disappeared, causing the entire world to suffer from hunger. Realizing his mistake, Shiva begged for food, and Parvati fed him with her own hands. This act not only humbled Shiva but also established food as a sacred gift. The temple was later reconstructed in its current form by Maratha queen Ahilyabai Holkar in the 18th century, who also rebuilt several temples in Varanasi including the Kashi Vishwanath Temple. The main idol of Goddess Annapurna is made of gold, and once a year, during Annkoot (a day after Diwali), the idol is opened for darshan and a grand feast is offered to devotees. The temple is a vital part of Varanasi’s spiritual landscape, reminding all that feeding the hungry is one of the highest forms of worship. It continues to draw pilgrims, especially those who seek prosperity, nourishment, and spiritual satisfaction.",
            "image0": "https://i.pinimg.com/474x/ee/2e/cc/ee2eccaa310117924d9c5025d944faa0.jpg",
            "image1": "https://i.pinimg.com/474x/1c/a3/54/1ca3546d54f8d335d949f75b1d4cfd3c.jpg",
            "image2": "https://i.pinimg.com/474x/e9/cc/20/e9cc20e275fbbc6d1b67e86e418ac18d.jpg",
            "video": "https://www.youtube.com/embed/VZ-3mBxsuNc?si=rD2CMryuiDK-ZPId"
        },
        {
            "places ": "Assi Ghat",
            "category": "Spiritual / Ghat Experience",
            "lat-lon": "25.2885° N,83.0064° E",
            "address": "Assi Ghat Rd, Dumraon Colony, Varanasi, Uttar Pradesh 221005",
            "location-link": "https://maps.app.goo.gl/TGybr2wVCyEvemS78",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "Yes (mornings + walking tours)",
            "establish-year": "In ancient times",
            "fee": "Entry: Free | Subah-e-Banaras ₹100 | Guide: ₹100–₹300",
            "description": "Assi Ghat is the southernmost ghat of Varanasi, famous for its tranquil ambiance and cultural significance. It is a popular spot for spiritual seekers, with morning yoga sessions and evening Aarti ceremonies. The ghat offers a picturesque view of the Ganges, making it a favored location for locals and tourists. It also serves as a hub for cafes, music, and art, reflecting the vibrant cultural fabric of Varanasi.",
            "essential": "Open to all visitors. Modest attire is recommended. Photography is generally allowed, but seeking permission before taking pictures of locals is courteous.",
            "story": "Assi Ghat, located at the southernmost end of the string of ghats in Varanasi, is one of the city’s most iconic and spiritually vibrant spots. According to ancient Hindu texts and legends, this is where Goddess Durga threw her sword into the Assi River after slaying demons Shumbha and Nishumbha, giving the ghat its name. Historically, Assi Ghat has been a favorite spot for saints, scholars, and poets, including the famous Hindi poet Tulsidas, who is believed to have lived and written here. It holds deep significance in pilgrimage routes, as it is considered the starting point for many spiritual journeys through Kashi. Today, Assi Ghat is a dynamic blend of tradition and modern life—morning yoga sessions, Subah-e-Banaras (a daily spiritual program with music and Ganga aarti), and bustling evenings make it a cultural and spiritual hub. Unlike the more crowded Dashashwamedh Ghat, Assi Ghat offers a peaceful yet deeply sacred experience along the banks of the holy Ganga River.",
            "image0": "https://i.pinimg.com/474x/04/0e/c2/040ec2ed0a672c7e6f7ad42051db44b2.jpg",
            "image1": "https://i.pinimg.com/474x/6f/36/3c/6f363cad62c199ce54f43a2e8e77cb2e.jpg",
            "image2": "https://i.pinimg.com/474x/20/4e/dc/204edc74dbb96e7e5dd04294a6e12363.jpg",
            "video": "https://www.youtube.com/embed/4OJgZCtJIAk?si=oMgx6TqGW8IZPFM6"
        },
        {
            "places ": "Dashashwamedh Ghat",
            "category": "Spiritual / Ghat Experience",
            "lat-lon": "25.3062° N,83.0103° E",
            "address": "Dashashwamegh Ghat,Varanasi,Uttar Pradesh,221001",
            "location-link": "https://maps.app.goo.gl/LiTgZjpHQ5zzq31i6",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "yes(Highly recommended)",
            "establish-year": 1748,
            "fee": "Entry: Free | Aarti Seat ₹100–₹200 | Boat ₹1000 | Guide: ₹200–₹400",
            "description": "Dashashwamedh Ghat is one of the oldest and most vibrant ghats in Varanasi. It is known for the spectacular Ganga Aarti, where priests perform synchronized rituals with lamps and chants. The ghat is surrounded by bustling markets and eateries, offering a lively experience. The spiritual ambiance, colorful lights, and hymns create a mesmerizing atmosphere, attracting tourists and devotees worldwide.",
            "essential": "Modest attire is recommended. The evening Ganga Aarti attracts large crowds, so arriving early is advisable. Photography is allowed but should be done respectfully.",
            "story": "Dashashwamedh Ghat is the oldest and most historically significant ghat in Varanasi, situated close to the Kashi Vishwanath Temple on the banks of the Ganga River. According to Hindu mythology, it was at this sacred site that Lord Brahma performed a grand Ashwamedh Yajna (horse sacrifice) involving ten horses to welcome Lord Shiva to the earthly realm—hence the name \"Dashashwamedh\", meaning “Ten Horse Sacrifice.” Another version of the legend states that Lord Brahma created the ghat himself to perform rituals and establish Kashi as a divine city. Historically, the ghat has been a center of Vedic rituals and pilgrimage for centuries. The current structure was rebuilt in the 18th century by the Maratha rulers, notably Peshwa Balaji Baji Rao in 1748, and later improved by Ahilyabai Holkar. Dashashwamedh Ghat has since remained the heart of religious activity in Varanasi, especially known for its vibrant Ganga Aarti, which continues the ancient tradition of daily worship to the sacred river.",
            "image0": "https://i.pinimg.com/474x/fa/59/eb/fa59eb0d87186ebf38cba50393aab81b.jpg",
            "image1": "https://i.pinimg.com/474x/17/ec/eb/17eceb5185148d599a95ba375565968c.jpg",
            "image2": "https://i.pinimg.com/474x/34/b3/b1/34b3b124005b8f988f3e217ecaebf870.jpg",
            "video": "https://www.youtube.com/embed/uzFAm2P0G3s?si=4zxXaOssK2WiX5bM"
        },
        {
            "places ": "Manikarnika Ghat",
            "category": "Spiritual / Ghat Experience",
            "lat-lon": "25.3108° N,83.0141° E",
            "address": "Near Lalita Ghat, Lahori Tola, Varanasi, Domari, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/tSp5oLsyrWQ94P6q6",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "yes Highly needed (to explain cremation rituals)",
            "establish-year": "In ancient times",
            "fee": "Entry: Free | Donation optional | Guide: ₹200–₹500",
            "description": "Manikarnika Ghat is one of the most sacred and oldest ghats in Varanasi, known as the principal cremation site. Hindus believe that those cremated here attain Moksha (liberation from the cycle of rebirth). The continuous cremation pyres and the spiritual chants create a powerful and reflective atmosphere. It symbolizes the cycle of life and death, making it a significant site of religious importance.",
            "essential": "Photography of cremation ceremonies is strictly prohibited. Visitors should maintain a respectful distance and behave solemnly.",
            "story": "Manikarnika Ghat is one of the oldest and most sacred cremation ghats in Varanasi, known as the gateway to moksha (liberation). According to ancient Hindu legend, Lord Vishnu performed intense penance here to please Lord Shiva. Pleased with his devotion, Shiva granted the land of Kashi as an eternal sacred city. During this divine episode, Vishnu dug a well with his discus, and while bathing, Shiva’s earring (Manikarnika) fell into it—hence the name Manikarnika, meaning \"jeweled earring.\" This well, known as the Manikarnika Kund, still exists near the ghat and is considered highly auspicious. It is believed that cremation at Manikarnika Ghat ensures liberation from the cycle of rebirth. According to mythology, Maa Parvati asked Lord Shiva to ensure that devotees dying in Kashi achieve moksha, so Shiva whispers the Taraka mantra into the ears of the dying at this ghat. Historically, the ghat has been continuously active for thousands of years, and it remains the eternal flame cremation site, where funeral pyres burn 24/7 without pause.",
            "image0": "https://i.pinimg.com/474x/ec/a5/a0/eca5a08e6f62a68e7ff7302848ef610b.jpg",
            "image1": "https://i.pinimg.com/474x/aa/12/8f/aa128fee3e40a0ad9117015a804ad9d8.jpg",
            "image2": "https://i.pinimg.com/474x/64/12/c8/6412c83f3f7864940f40af5269413a35.jpg",
            "video": "https://www.youtube.com/embed/ZF_kX6Ux-pA?si=7A9bp6zGcOx9eMyy"
        },
        {
            "places ": "Namo Ghat",
            "category": "Spiritual / Ghat Experience",
            "lat-lon": "25.3251° N,83.0353° E",
            "address": "Rajghat, Varanasi, Suzabad, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/7zx2o6fiZaTu49bB6",
            "open-day": "Monday to Sunday",
            "open-time": "05:00AM - 10:00PM",
            "guide-availiblity": "Yes (new area guides)",
            "establish-year": 2021,
            "fee": "Entry: Free | Boat/Ferry ₹50–₹100 | Guide: ₹150–₹300",
            "description": "Namo Ghat is a modern and well-maintained ghat with unique architectural designs and comfortable seating areas. It offers stunning views of the Ganges, especially during sunrise and sunset. The ghat features modern amenities like pathways, gardens, and illuminated sculptures, making it a popular spot for locals and tourists. It symbolizes the blend of tradition and modernity in Varanasi.",
            "essential": "Open to the public. Cleanliness is expected, and littering is prohibited. Respect the sanctity of the river while performing rituals.",
            "story": "Namo Ghat, formerly known as Khidkiya Ghat, is a newly redeveloped and iconic riverfront on the banks of the Ganga in Varanasi, named in honor of Prime Minister Narendra Modi (\"NaMo\") for his contributions to transforming the city under the Kashi Vishwanath Corridor project. Designed with modern infrastructure and aesthetics—such as the massive folded-hand sculptures symbolizing Indian hospitality—it blends spirituality, culture, and inclusivity, offering facilities like wheelchair access, cultural spaces, and peaceful riverfront views. While relatively new, it holds cultural importance by continuing the centuries-old tradition of Varanasi’s ghats being centers for spiritual and communal life.",
            "image0": "https://i.pinimg.com/474x/51/78/79/5178794598804f10c5de2a1397c74ced.jpg",
            "image1": "https://i.pinimg.com/736x/88/1d/9e/881d9e6fb514bffa2bec94fa8f3cafc5.jpg",
            "image2": "https://i.pinimg.com/474x/e8/8c/15/e88c150564148e0a70ed107b1f9ee192.jpg",
            "video": "https://www.youtube.com/embed/sBhAV3OXNW4?si=FXR5jTQBH1FxmYAu"
        },
        {
            "places ": "Tulsi Ghat",
            "category": "Spiritual / Ghat Experience",
            "lat-lon": "25.2904° N,83.0064° E",
            "address": "B 2/40 , Tulsi ghat, Assi Rd, Varanasi, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/BkAxaUwzW2b3Dcy97",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "Yes (part of walking trail)",
            "establish-year": "16th century",
            "fee": "Entry: Free | Events (if any): ₹50–₹100 | Guide: ₹100–₹250",
            "description": "Named after the poet-saint Tulsidas, Tulsi Ghat is known for its cultural and literary significance. It is believed to be the place where Tulsidas wrote the Ramcharitmanas. The ghat is also a hub for cultural events, including musical performances and yoga sessions. Its peaceful ambiance and spiritual importance make it a serene spot for reflection and cultural exploration.",
            "essential": "Open to all visitors. Modest attire is recommended. Photography is allowed but should be done respectfully.",
            "story": "Tulsi Ghat is one of the most culturally and spiritually significant ghats of Varanasi, named after the great 16th-century saint and poet Goswami Tulsidas, the author of the Ramcharitmanas, a devotional retelling of the Ramayana in Awadhi. It is believed that Tulsidas lived and wrote much of his literary work at this very site. Originally known as Lolark Ghat, it was renamed in his honor due to his deep connection to the place. According to local legend, it was here that Tulsidas had a divine vision of Lord Hanuman, which further inspired his devotion and writing. The ghat is home to the Tulsi Manas Temple and the Lolark Kund, a sacred pond where devotees bathe to seek blessings for children and health. Historically, the ghat was rebuilt in the 19th century by a devotee named Baldeo Das Birla. Tulsi Ghat continues to be a center of cultural performances, especially during the Ram Lila and Krishna Leela, keeping Varanasi’s living traditions vibrant and alive.",
            "image0": "https://i.pinimg.com/736x/46/20/12/46201294b31204dff0f1fa7a256422a4.jpg",
            "image1": "https://i.pinimg.com/474x/d7/05/8f/d7058f1bbceb292077d3c8cfa8feac61.jpg",
            "image2": "https://i.pinimg.com/474x/27/e4/a9/27e4a97bb7257d03e0c5859b30206324.jpg",
            "video": "https://www.youtube.com/embed/DO3yrp9LAWk?si=z3IcO8UMMaP3FWad"
        },
        {
            "places ": "Banaras Hindu University (BHU)",
            "category": "City Place / Iconic Landmark",
            "lat-lon": "25.2683° N,82.9903° E",
            "address": "Ajagara, Varanasi, Uttar Pradesh 221005",
            "location-link": "https://maps.app.goo.gl/cVKJnPf5BQagZSsz5",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "Yes (local tour guides)",
            "establish-year": 1916,
            "fee": "Entry: Free | Guide: ₹200–₹300",
            "description": "Established in 1916 by Pandit Madan Mohan Malaviya, BHU is one of Asia’s largest residential universities. It is renowned for its academic excellence and sprawling green campus. The university complex includes the Vishwanath Temple, Bharat Kala Bhavan Museum, and vibrant student life. Its architectural beauty and educational heritage attract scholars and tourists from around the world.",
            "essential": "Open to visitors, but certain departments and facilities may have restricted access. Photography is generally allowed in public areas but prohibited in some academic buildings.",
            "story": "The historic story of Banaras Hindu University (BHU) begins in the early 20th century, when Pandit Madan Mohan Malaviya, a nationalist leader, social reformer, and educationist, envisioned a university that would revive India’s ancient tradition of learning while incorporating modern education. At a time when India was under British colonial rule, Malaviya sought to empower the nation through education rooted in Indian values, culture, and self-reliance. With the support of Indian rulers like the Maharaja of Darbhanga and the Maharaja of Banaras, and significant public funding, BHU was founded in 1916 through the passage of the BHU Act in the Indian Legislative Council. The university became a hub for the Indian independence movement, with many of its students and professors participating in nationalist activities. It was also among the first institutions to promote education in Sanskrit, Ayurveda, Indian philosophy, and sciences side by side. The campus, spread across vast land donated by the Kashi royal family, became a model of integrated learning, symbolizing India’s intellectual and spiritual resurgence.",
            "image0": "https://i.pinimg.com/736x/b2/6b/67/b26b6711303f25fb407623b935634aa8.jpg",
            "image1": "https://i.pinimg.com/474x/6e/81/93/6e8193a8969d4e844a75b2efea4a8568.jpg",
            "image2": "https://i.pinimg.com/474x/64/02/ad/6402ad0915fe47848519f5e02bb35bfa.jpg",
            "video": "https://www.youtube.com/embed/UCXcvk_x1-0?si=9RKy0YsQPRKg1VCR"
        },
        {
            "places ": "Ramnagar Fort",
            "category": "Heritage Landmark",
            "lat-lon": "25.2695° N,83.0249° E",
            "address": "Varanasi Rd, Ram nagar, Ramnagar, Uttar Pradesh 221008",
            "location-link": "https://maps.app.goo.gl/DYBqg4GtmBzdUR9x9",
            "open-day": "Monday to Sunday",
            "open-time": "08:00AM - 08:00PM",
            "guide-availiblity": " Yes",
            "establish-year": 1750,
            "fee": "Entry: ₹50 (Indian), ₹150 (Foreigner), Camera ₹50 | Guide: ₹200–₹400",
            "description": "Located on the eastern bank of the Ganges, Ramnagar Fort was built in 1750 by Maharaja Balwant Singh. The sandstone structure exhibits Mughal architecture and serves as the residence of the Kashi Naresh (King of Varanasi). The fort houses a museum showcasing vintage cars, royal costumes, manuscripts, and weapons. It offers panoramic views of the Ganges and is famous for hosting the annual Ramlila festival.",
            "essential": "Open to visitors with an entry fee. Photography is allowed in most areas but restricted in the museum. Maintaining cleanliness and respecting the property is expected.",
            "story": "Ramnagar Fort, located on the eastern banks of the Ganga River, is an imposing historical landmark in Varanasi, built in the 16th century by Kesar Singh, the Rajput king of Banaras. The fort’s construction was initiated by Maharaja Chet Singh in the 1700s to serve as the royal residence and defensive stronghold. The fort is made of red sandstone and has a mix of architectural styles, with features reminiscent of both Mughal and Rajput design. Over the centuries, the fort has been the seat of the Banaras Rajput family, who played a crucial role in the region’s governance and culture. A key historical event took place here during the Indian Rebellion of 1857, when Maharaja Chet Singh led a resistance against British rule, although the fort eventually fell to British forces. Today, the fort houses the Ramnagar Fort Museum, showcasing an impressive collection of royal artifacts, vintage cars, and weapons. The fort is also known for its proximity to the famous Ramlila processions, which are held every year in honor of Lord Rama, where the fort serves as the backdrop for these grand celebrations.",
            "image0": "https://i.pinimg.com/474x/c8/81/f8/c881f8f86eb6e46ecaa21cf7f999bdda.jpg",
            "image1": "https://i.pinimg.com/474x/9c/da/c2/9cdac27cc36ee62f8949ed2166a84f05.jpg",
            "image2": "https://i.pinimg.com/736x/8a/e4/9c/8ae49c9685e84f8537928e302439d445.jpg",
            "video": "https://www.youtube.com/embed/tATy-6gHwPA?si=jHdhGKzn11U6tL2P"
        },
        {
            "places ": "Chunar Fort",
            "category": "Heritage Landmark",
            "lat-lon": "25.1234° N,82.8758° E",
            "address": "4VFG+87X, Tammanpatti, Uttar Pradesh 231304",
            "location-link": "https://maps.app.goo.gl/Xt5yx6588YtCt7k2A",
            "open-day": "Monday to Sunday",
            "open-time": "09:00AM - 5:00PM",
            "guide-availiblity": "Yes (fewer guides)",
            "establish-year": "11th century",
            "fee": "Entry: ₹25–₹50 | Parking ₹50 | Guide: ₹300–₹600",
            "description": "Located on the banks of the Ganges, Chunar Fort is a historic fortress with a strategic military past. It has witnessed the reign of several dynasties, including the Mughals and the British. The fort offers panoramic views of the river and the surrounding landscape. Its ancient architecture, secret passages, and historical significance attract history enthusiasts and tourists alike. The fort's mystical charm and historical tales make it a fascinating destination.",
            "essential": "An entry fee is applicable. Photography is allowed. Caution is advised while exploring the ancient structure.",
            "story": "Chunar Fort is a historic and strategically significant fort located about 40 kilometers southeast of Varanasi, overlooking the Ganga River. The fort's origins date back to ancient times, with the earliest known references to the structure appearing in Mauryan period inscriptions. However, its most significant history unfolded during the medieval period when it was a key stronghold in the region's defense. The fort was initially built by Emperor Ashoka of the Maurya dynasty, although it was later expanded and fortified by various rulers. In the 16th century, Sher Shah Suri, the founder of the Suri Empire, made substantial improvements to the fort, fortifying it and using it as a stronghold in his struggle against the Mughal Empire. The fort’s strategic position on the Ganga allowed it to control the trade route, and over time, it became an important military base for various rulers, including the Mughals and the British. During the British colonial period, Chunar Fort was used as a prison for Indian freedom fighters, adding another layer to its historical significance. The fort, though in ruins today, is still an impressive structure with large walls, a moat, and numerous gates, offering insight into the fortification techniques of its time. It continues to be a site of historical interest for tourists and researchers.",
            "image0": "https://i.pinimg.com/736x/12/b5/f1/12b5f1203e0b76d7f9130815eeab7c55.jpg",
            "image1": "https://i.pinimg.com/474x/ea/cf/31/eacf31f744b8e496d8313844bf5781a2.jpg",
            "image2": "https://i.pinimg.com/736x/23/39/d3/2339d3475f1a20a21e8bbe5b08725a74.jpg",
            "video": "https://www.youtube.com/embed/6TeKZeVm3mU?si=vvCBHubLTk3wStsj"
        },
        {
            "places ": "The Ancient Well of Chandrakoop",
            "category": "Heritage / Spiritual Spot",
            "lat-lon": "25.3127° N,83.0148° E",
            "address": "CK 7, 12, Siddheswari Gali, behind Sankatha Mata Mandir, Garwasitola, Ghasi Tola, Varanasi, Domari, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/9siPvYZbCURopXbZ9",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "No(Rarely available)",
            "establish-year": "In ancient times",
            "fee": "Entry: Free (part of KVT) | Guide: Included in KVT tour",
            "description": "The Ancient Well of Chandrakoop is considered sacred and is believed to possess purifying properties. Pilgrims traditionally offer water and flowers, seeking spiritual cleansing. The well is associated with various legends and is an integral part of the religious landscape of Varanasi. Its historical and spiritual significance makes it a unique attraction for those exploring Varanasi’s cultural heritage.",
            "essential": "Visitors should exercise caution near the well. Offerings are customary. Silence and respect for local beliefs are expected.",
            "story": "The Ancient Well of Chandrakoop in Varanasi is steeped in both historical and mythological significance. According to local legends, this well was created by the ancient king Chandraketu, who sought to ensure a continuous water supply for his kingdom. It is believed that the well was constructed during the Mauryan era, with historical accounts suggesting it was designed to withstand dry periods and provide fresh, pure water to the people of the region. The well is particularly revered for its association with Lord Shiva, as it is said that Lord Shiva blessed the well with divine power to purify the waters, ensuring its life-sustaining properties. Over time, the well came to be considered a sacred source of spiritual and physical purification, with people coming to offer prayers and seek blessings for health, prosperity, and cleansing of sins. The legend also speaks of Chandraketu's connection to the moon (Chandra), symbolizing the well’s purity and the lunar cycle, believed to grant peace and tranquility. Despite its modest appearance today, the well holds a special place in Varanasi’s vast spiritual landscape, serving as a symbol of both the city’s historical ingenuity and divine grace.",
            "image0": "https://images.news18.com/telugu/uploads/2024/01/1706712530_1706694473_chandrakoop-2-2024-01-d90ef58d4f6cc41ef7c26e021cc81527.jpg",
            "image1": "https://hindi.cdn.zeenews.com/hindi/sites/default/files/2024/01/31/2610120-v-5-copy.jpg?im=FitAndFill=(1200,900)",
            "image2": "https://i.pinimg.com/736x/c2/5e/98/c25e9897f0b3763ce5c176f01397dd09.jpg",
            "video": "https://www.youtube.com/embed/uIH1dTAMrS8?si=v-TIh1TRdyZj36sS"
        },
        {
            "places ": "Markandeshwar Mahadev Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "22.3113° N,83.0100° E",
            "address": "8265+GXX, Kashi Vishwnath Rd, Lahori Tola, Varanasi, Uttar Pradesh 221010",
            "location-link": "https://maps.app.goo.gl/fX7GQKnng7JMtC4K6",
            "open-day": "Monday to Sunday",
            "open-time": "05:00AM - 10:00PM",
            "guide-availiblity": "Yes(On request)",
            "establish-year": "In ancient times",
            "fee": "Entry: Free | Puja ₹50–₹100 | Guide: ₹200–₹300",
            "description": "Dedicated to Lord Shiva, Markandeshwar Mahadev Temple is linked to the legend of sage Markandeya, who conquered death by Lord Shiva's blessings. It is a revered shrine for devotees seeking longevity and protection. The ancient architecture and spiritual significance attract pilgrims and tourists alike. The peaceful surroundings and historical importance make it a serene place for reflection and worship.",
            "essential": "Footwear removal is mandatory. Photography policies vary, so it’s best to inquire locally. Offerings are allowed but should be bought from authorized vendors.",
            "story": "The Markandeshwar Mahadev Temple is one of the ancient Shiva temples of Varanasi, deeply connected to the legend of Rishi Markandeya, a symbol of unwavering devotion. According to Hindu mythology, Sage Markandeya was born to a childless couple after intense penance, but with a destined lifespan of only 16 years. As his end neared, young Markandeya took refuge in the worship of Lord Shiva, meditating and chanting the Mahamrityunjaya Mantra beside a Shiva Lingam. When Yamraj, the god of death, came to claim his soul, Markandeya clung to the Shiva Lingam. Yamraj threw his noose, which mistakenly landed around the Lingam too—an act that angered Shiva. Emerging in fury, Lord Shiva struck down Yamraj and granted Markandeya eternal life, declaring that true devotion could even conquer death. It is believed that this powerful event took place at the site where the Markandeshwar Mahadev Temple now stands. The temple, though modest in appearance, is revered for its spiritual energy and is especially visited by devotees seeking long life, protection from premature death, and spiritual strength. The surrounding area is peaceful, making it ideal for meditation and quiet worship.",
            "image0": "https://i.pinimg.com/474x/5f/19/3a/5f193ae76a96336d8d7797f41501ab6a.jpg",
            "image1": "https://i.pinimg.com/474x/4e/1e/31/4e1e31d43b390618abfad8a3e8e55690.jpg",
            "image2": "https://i.ytimg.com/vi/LlfxjaYvyCM/maxresdefault.jpg",
            "video": "https://www.youtube.com/embed/Vph6_wQYN08?si=noN_mwfB1XIX58Qf"
        },
        {
            "places ": "Nepali Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.3099° N,83.0130° E",
            "address": "Near Lalita Ghat, Lahori Tola, Varanasi, Domari, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/nGEsUWvKA8zqa9zr9",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "Yes",
            "establish-year": "19th century",
            "fee": "Entry: Free | Donation ₹20–₹50 | Guide: ₹150–₹300",
            "description": "Built by the King of Nepal, the Nepali Temple reflects exquisite Nepali-style wooden architecture. It is dedicated to Lord Shiva and resembles the famous Pashupatinath Temple of Kathmandu. The intricate wood carvings and peaceful surroundings make it a serene spiritual spot. Its unique architectural style distinguishes it from other temples in Varanasi.",
            "essential": "Footwear removal is mandatory. Photography is allowed but should be done respectfully. Silence is appreciated inside the temple premises.",
            "story": "The Nepali Temple in Varanasi, locally called the Shivala Ghat Temple or Mini Khajuraho, is a stunning 19th-century shrine dedicated to Lord Shiva, located at Lalita Ghat near the Ganga River. Its history is tied to the King of Nepal, Rana Bahadur Shah, who was exiled to Varanasi in the early 1800s after political conflict in his kingdom. Deeply devoted to Lord Shiva, he decided to build a replica of Kathmandu’s famous Pashupatinath Temple in Kashi. Though Rana Bahadur Shah died before the temple was completed, his son Girvan Yuddha Bikram Shah ensured the temple’s completion around 1843. The temple was constructed using traditional Nepali architecture, with wooden carvings, terracotta tiles, and a pagoda-style design, distinct from North Indian temple styles. What makes the temple especially unique is its intricate woodwork and erotic sculptures, earning it the nickname Mini Khajuraho. Set in a peaceful corner of Varanasi, the Nepali Temple stands as a symbol of spiritual unity between India and Nepal, and is a beautiful reminder of Varanasi’s long-standing cultural connections with the Himalayan region.",
            "image0": "https://i.pinimg.com/736x/64/0f/e7/640fe7751348320cae5ba2a174fb75e8.jpg",
            "image1": "https://i.pinimg.com/474x/30/af/56/30af56e1a2ea18a7e0f6da954b43c987.jpg",
            "image2": "https://i.pinimg.com/474x/41/73/68/41736879e8a34c5c7fbd605fec0298c5.jpg",
            "video": "https://www.youtube.com/embed/jMwXpPS7TgQ?si=6D-yHDHuTAPmkEAO"
        },
        {
            "places ": "Bharat Kala Bhavan Museum",
            "category": "Heritage / Museum / Cultural Spot",
            "lat-lon": "25.2717° N,83.0101° E",
            "address": "Banaras Hindu University, Semi Circle Road No. 3 Opp Institute of Mgmt Studies, Varanasi, Uttar Pradesh 221005",
            "location-link": "https://maps.app.goo.gl/C8oFM65RS27iEvnF9",
            "open-day": "Monday to Sunday",
            "open-time": "10:30AM - 04:30PM",
            "guide-availiblity": "Yes (in-house staff)",
            "establish-year": 1920,
            "fee": "Entry: ₹20 (Indian), ₹100 (Foreigner), Camera ₹50 | Guide: ₹100–₹300",
            "description": "Located within the BHU campus, Bharat Kala Bhavan Museum is a treasure trove of Indian art and culture. It houses an extensive collection of paintings, sculptures, textiles, and archaeological artifacts. The museum is known for its collection of miniature paintings and manuscripts. It provides insights into the rich cultural and historical heritage of India, making it an educational and cultural hub.",
            "essential": "Photography is restricted in certain sections. An entry fee is applicable. Silence and respectful behavior are expected inside the museum.",
            "story": "The Bharat Kala Bhavan Museum, located inside the Banaras Hindu University campus, is a historic institution founded in 1920 and integrated into BHU in 1950. It houses over one lakh priceless artifacts, including ancient sculptures, paintings, coins, textiles, and manuscripts, along with a special gallery dedicated to Mahatma Gandhi. The museum serves as a vital archive of Indian art and heritage, particularly from the ancient, medieval, and Mughal periods, making it an essential destination for scholars, historians, and cultural enthusiasts seeking to explore the deep artistic legacy of India and the cultural richness of Varanasi.",
            "image0": "https://i.pinimg.com/474x/6b/26/56/6b2656a6996ecd07e906858319847769.jpg",
            "image1": "https://i.pinimg.com/736x/21/4a/1c/214a1c32a5f182cacd44c71e36cf7f7c.jpg",
            "image2": "https://i.pinimg.com/474x/37/5b/51/375b51b1885202e2085f1d944082133d.jpg",
            "video": "https://www.youtube.com/embed/VZbEsNM7dvA?si=zS3GBu-zqEvSY4i8"
        },
        {
            "places ": "Kabir Math",
            "category": "Spiritual / Meditation Retreat",
            "lat-lon": "25.3225° N,83.0078° E",
            "address": "SHRI KABIR PRAKATY STHALI PURANA KABIR MATH, Lahartara Boulia, Varanasi, Uttar Pradesh 221002",
            "location-link": "https://maps.app.goo.gl/rTYK35E9axc1Qu7t7",
            "open-day": "Monday to Sunday",
            "open-time": "05:00AM - 07:30PM",
            "guide-availiblity": "yes(On prior contact)",
            "establish-year": "15th century",
            "fee": "Entry: Free | Donations optional | Guide: ₹300–₹500",
            "description": "Kabir Math is a spiritual site dedicated to the 15th-century poet-saint Kabir. It preserves his teachings and way of life. The Math houses Kabir's samadhi and a collection of his literary works. The peaceful environment and simplicity reflect Kabir's philosophy of love, equality, and devotion. It serves as a spiritual retreat for followers and admirers of Kabir's teachings.",
            "essential": "Footwear should be removed before entering. Photography may be restricted in certain areas. Silence and respectful behavior are expected.",
            "story": "Kabir Math, also known as Kabir Chaura Math, is a revered spiritual center in Varanasi, dedicated to preserving and disseminating the teachings of the 15th-century mystic poet and saint, Kabir. Established by Surat Gopal, one of Kabir's immediate disciples, this Math serves as a memorial to the saint's profound influence on the Bhakti movement and his emphasis on a formless, universal God. The term \"Chaura\" is derived from \"Chauraha,\" meaning a four-way crossing, signifying the Math's role as a crossroads of spiritual thought and practice. Kabir's teachings, which transcended religious boundaries, are encapsulated in texts like the Bijak, and the Math has been instrumental in promoting these philosophies across regions like Gujarat, Uttar Pradesh, and Bihar. The Math not only houses relics and manuscripts associated with Kabir but also serves as a hub for followers of the Kabir Panth, a sect that emerged from his teachings. Over the centuries, Kabir Math has remained a beacon of spiritual learning, attracting devotees and scholars alike who seek to understand and live by Kabir's message of love, equality, and devotion.",
            "image0": "https://i.pinimg.com/474x/70/51/33/705133dc162856aa4d99686940b3cee2.jpg",
            "image1": "https://i.pinimg.com/474x/d7/27/c7/d727c717aab7cc8fe16fa4dab27be632.jpg",
            "image2": "https://i.pinimg.com/1200x/da/a8/81/daa8817222d2221e700a6f55e5ea1aee.jpg",
            "video": "https://www.youtube.com/embed/z6zDikeWqC0?si=ShsrFe45yeAf0IGg"
        },
        {
            "places ": "Bharat Mata Temple",
            "category": "Religious / Spiritual Temple",
            "lat-lon": "25.3213° N,82.9870° E",
            "address": "Guru Nanak Nagar Colony, Chetganj, Varanasi, Uttar Pradesh 221002",
            "location-link": "https://www.google.co.in/maps/place/Bharath+Mata+Mandir,+Guru+Nanak+Nagar+Colony,+Chetganj,+Varanasi,+Uttar+Pradesh+221002/@25.3172249,82.9893083,839m/data=!3m2!1e3!4b1!4m6!3m5!1s0x398e2dfcc052fd13:0xc1a04258aeeda868!8m2!3d25.3172249!4d82.9893083!16s%2Fm%2F012z8mq1?entry=ttu&g_ep=EgoyMDI1MDMxMi4wIKXMDSoASAFQAw%3D%3D",
            "open-day": "Monday to Sunday",
            "open-time": "7:30 AM - 5:30 PM",
            "guide-availiblity": "Yes",
            "establish-year": 1936,
            "fee": " Entry: Free | Guide: ₹100–₹200",
            "description": "Bharat Mata Temple in Varanasi, built by Babu Shiv Prasad Gupta and inaugurated by Mahatma Gandhi in 1936, is a unique temple dedicated to Mother India, featuring a detailed 3D relief map of undivided India carved in marble. Unlike traditional temples, it has no idols and symbolizes national unity and patriotism",
            "essential": "Entry is free; footwear must be removed before entering; photography is allowed but recommended to seek permission first; best time to visit is during daytime, preferably in the morning; maintain silence and respect the patriotic significance of the temple.",
            "story": "Bharat Mata Temple in Varanasi is a unique and deeply patriotic shrine, unlike any other in India, as it is dedicated not to a deity from mythology but to Bharat Mata, or Mother India, symbolizing the soul, culture, and unity of the nation itself. Established in 1936 by Babu Shiv Prasad Gupta, a nationalist and philanthropist, and inaugurated by Mahatma Gandhi himself, this temple emerged during the freedom struggle as a sacred space representing India not just as a landmass but as a living embodiment of its people, heritage, and spiritual legacy. The temple houses no idol of a god or goddess but instead features a large, intricately carved relief map of undivided India, made in marble, depicting the mountains, rivers, and land of the country in stunning topographical detail. This symbolic representation was meant to inspire national pride, unity, and a spiritual connection to the motherland among Indians during the turbulent pre-independence era. It was designed to foster a sense of unity beyond religion, caste, or region—placing the nation itself as the object of reverence. Situated within the Mahatma Gandhi Kashi Vidyapith campus, the temple is a rare architectural and ideological marvel that merges spiritual devotion with national identity. The elevation lines and geological accuracy of the map are not just artistic but symbolic—reminding every visitor of the sacred geography of the land and the importance of its protection and unity. Unlike traditional temples that host rituals and daily aarti, Bharat Mata Temple is a silent place of reflection, where visitors are encouraged to contemplate their role in serving the nation. It also reflects the larger philosophy of India’s freedom movement, which viewed the country not as a political entity alone but as a divine mother whose cultural and spiritual greatness must be preserved. In a city known for its countless temples to gods and goddesses, Bharat Mata Temple stands apart as a temple to the spirit of India itself, where devotion is measured not in offerings but in love, service, and loyalty to the motherland.",
            "image0": "https://i.pinimg.com/474x/79/3f/f1/793ff1caacb3e9eb59c1f6fda9bb5f3a.jpg",
            "image1": "https://i.pinimg.com/474x/b3/68/6b/b3686b533a47992ff34200155d17e761.jpg",
            "image2": "https://i.pinimg.com/474x/28/51/d3/2851d385b3fa731f93e631f89223c5f2.jpg",
            "video": "https://www.youtube.com/embed/c5b3HWlWciM?si=KzlGadDxS8JR6bR7",
            "NaN": "."
        },
        {
            "places ": "Thatheri Bazaar",
            "category": "Local Shopping / Market",
            "lat-lon": "25.3183° N, 83.0071° E",
            "address": "Thatheri Bazaar,Varanasi,Uttar Pradesh,221001",
            "location-link": "https://www.google.co.in/maps/place/Thatheri+Bazar,+Ghasi+Tola,+Varanasi,+Uttar+Pradesh+221001/@25.3139771,83.0123772,839m/data=!3m2!1e3!4b1!4m6!3m5!1s0x398e2e1ed4734c43:0xcceeff792a29faf0!8m2!3d25.3138435!4d83.0123706!16s%2Fg%2F1pzyl201k?entry=ttu&g_ep=EgoyMDI1MDMxMi4wIKXMDSoASAFQAw%3D%3D",
            "open-day": "Monday to Sunday",
            "open-time": "10:00AM - 8:00PM",
            "guide-availiblity": "yes On request (shopping/local art tours)",
            "fee": " Entry: Free | Guide (optional): ₹150–₹300",
            "description": "Thatheri Bazaar is one of the oldest and most traditional markets in Varanasi, known for its skilled metalwork, handcrafted brass and copper items, wooden toys, and Banarasi silk products. This bustling marketplace is a paradise for those interested in authentic Indian craftsmanship and cultural souvenirs.",
            "essential": "Visit in the morning or late evening to avoid crowds; bargain smartly; use cycle rickshaws or walk; carry cash as many shops don’t accept cards; check product authenticity before buying; stay alert for touts and keep belongings secure",
            "image0": "https://blog.famousvaranasi.com/wp-content/uploads/2022/11/thatheri-bazar-min.webp",
            "image1": "https://i.pinimg.com/474x/d6/ef/98/d6ef98e9c32843d94aa61692ada6724c.jpg",
            "image2": "https://thumbs.dreamstime.com/z/thatheri-bazar-chowk-varanasi-india-street-market-men-phone-schoolchildren-food-stalls-motorbikes-cows-families-82032273.jpg",
            "video": "https://www.youtube.com/embed/IHRC1i8b9x8?si=70LVtTx0WEd_q7n8"
        },
        {
            "places ": "Godowlia Market",
            "category": "Local Shopping / Market",
            "lat-lon": "25.3167°N,83.0057°E",
            "address": "Godowlia Market,Varanasi,Uttar Pradesh,221001",
            "location-link": "https://www.google.co.in/maps/place/Godowlia,+Varanasi,+Uttar+Pradesh+221001/@25.3096159,83.0090789,839m/data=!3m2!1e3!4b1!4m6!3m5!1s0x398e2e1dd92f9889:0xa61275607925c1fc!8m2!3d25.3100747!4d83.0096485!16s%2Fg%2F11c1m_vl0s?entry=ttu&g_ep=EgoyMDI1MDMxMi4wIKXMDSoASAFQAw%3D%3D",
            "open-day": "Monday to Sunday",
            "open-time": "9:30 AM -10:30 PM",
            "guide-availiblity": "Yes (most visited shopping area)",
            "fee": "Entry: Free | Guide/Shopping help: ₹200–₹400",
            "description": "Godowlia Market is one of the busiest and most famous shopping areas in Varanasi, known for its vibrant atmosphere, traditional Banarasi silk, handicrafts, street food, and cultural essence. Located near Dashashwamedh Ghat, it is a must-visit for tourists looking for an authentic shopping and street food experience.",
            "essential": "Visit early or late to avoid crowds and heat; use cycle rickshaws or walk as the market is congested; bargain hard for Banarasi silk and handicrafts; try local street food like kachori sabzi, lassi, and Banarasi paan; stay alert, keep cash handy, secure belongings, and beware of touts or overpriced shops.",
            "image0": "https://i.pinimg.com/736x/8b/44/cd/8b44cd35072e66e9ae68fd1d6d1c95f9.jpg",
            "image1": "https://i.pinimg.com/474x/26/18/8f/26188f9370ded258b7b2b12da0afed8b.jpg",
            "image2": "https://i.pinimg.com/736x/51/01/e1/5101e12d19dd063ad426c8c99a15885b.jpg",
            "video": "https://www.youtube.com/embed/7Sqi_aBoqF8?si=o-2oGWB4cHi7r8J-"
        }
    ],
    "Hidden-gems": [
        {
            "hidden-gems": "Vishalakshi Temple",
            "category": "Shakti Peetha / Religious",
            "lat-lon": "25.3109° N,83.0107° E",
            "address": "Shri Kashi Vishalakshi Mata Shaktipeeth Temple, Kashi Lahori Tola Near Ganpati Guest House Meer Ghat, Varanasi, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/KfGXGWQKRgfkVYAe8",
            "open-day": "Monday to Sunday",
            "open-time": "06:00AM - 10:00PM",
            "guide-availiblity": "Yes (often part of temple walks)",
            "establish-year": "In ancient times",
            "fee": "Free; Puja ₹50–₹100; Guide: ₹150–₹300",
            "description": "Vishalakshi Temple is one of the Shakti Peethas, dedicated to Goddess Vishalakshi, an incarnation of Goddess Parvati. It is believed to be the site where the goddess’s earring fell. The temple is a revered pilgrimage site for devotees seeking blessings for prosperity and well-being. Its spiritual significance and vibrant rituals attract pilgrims and tourists, offering a unique cultural experience.",
            "essential": "Footwear removal is required. Photography inside the sanctum is prohibited. Silence and respect for religious practices are expected.",
            "story": "The Vishalakshi Temple, located near Manikarnika Ghat, is one of the 51 Shakti Peethas in India. It is believed that the earring or face of Goddess Sati fell here after her body was dismembered by Lord Vishnu’s Sudarshan Chakra. The name \"Vishalakshi\" means \"wide-eyed one,\" symbolizing the Goddess's compassionate and watchful gaze over Kashi. Vishalakshi represents the divine feminine counterpart to Kashi Vishwanath (Shiva) and is worshipped for blessings like marital harmony, fertility, and protection. The idol is richly adorned, and the temple is considered especially sacred during Navratri and to the South Indian community, who revere Vishalakshi alongside Meenakshi (Madurai) and Kamakshi (Kanchipuram). Despite multiple reconstructions, the spiritual power of the place is believed to remain unbroken.",
            "image0": "https://i.pinimg.com/1200x/f5/49/c2/f549c2e9d65f9cdf5b6ab02fbec00f7e.jpg",
            "image1": "https://upload.wikimedia.org/wikipedia/commons/9/93/%E0%AE%95%E0%AE%BE%E0%AE%9A%E0%AE%BF_%E0%AE%B5%E0%AE%BF%E0%AE%9A%E0%AE%BE%E0%AE%B2%E0%AE%BE%E0%AE%9F%E0%AF%8D%E0%AE%9A%E0%AE%BF_%E0%AE%95%E0%AF%8B%E0%AE%AF%E0%AE%BF%E0%AE%B2%E0%AF%8D.jpg",
            "image2": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT4T2fVAtWtvxN-MeeMw31HHvJYqO3Z3-upAPgov0FptWoYdZSEvI_LavElLz6H9LzQs0I&usqp=CAU",
            "video": "https://www.youtube.com/embed/rIC-Wb7K9HA?si=kQDKwy5BkJLaWZ3m"
        },
        {
            "hidden-gems": "Gauri Kedareshwar Temple",
            "category": "Religious / Ancient Shiva Temple",
            "lat-lon": "25.2997° N,83.0070° E",
            "address": "Mandir, Bagadha, Near, Gauri Kedareshwar Ln, Varanasi, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/BGpbZFkKWe5A5Raw8",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "yes Limited (on request)",
            "establish-year": "In ancient times",
            "fee": "Entry: Free; Puja ₹50–₹100; Guide: ₹150–₹250",
            "description": "Gauri Kedareshwar Temple is dedicated to Lord Shiva and Goddess Parvati. It is located on the banks of the Ganges and is known for its peaceful ambiance and spiritual significance. The temple is believed to grant blessings for marital harmony and prosperity. Its scenic location and divine atmosphere attract devotees and tourists seeking spiritual solace. The temple’s serene surroundings make it an ideal spot for meditation and reflection.",
            "essential": "Footwear removal is mandatory. Photography inside the sanctum is prohibited. Silence and respectful behavior are expected.",
            "story": "Located near Kedar Ghat, the Gauri Kedareshwar Temple is one of the most spiritually potent Shiva temples in Varanasi. It is dedicated to Lord Kedareshwar (a form of Shiva) and Goddess Gauri (Parvati). According to the Kashi Khand of the Skanda Purana, this temple is a spiritual equivalent of Kedarnath, meant for those unable to travel to the Himalayas. Built by the South Indian community, it reflects Dravidian architecture. Devotees believe that bathing in the Ganga at Kedar Ghat and then visiting the temple absolves sins. Gauri is worshipped for protection and fertility, while Kedareshwar grants liberation and strength. The temple becomes vibrant during Shravan and Mahashivratri, drawing pilgrims seeking spiritual transformation and divine grace.",
            "image0": "https://i.pinimg.com/736x/d1/e3/50/d1e350a59f935c93e7266922db9b35ec.jpg",
            "image1": "https://i.pinimg.com/736x/47/f4/61/47f4618c3a2adf1be42fa1b5e25c533a.jpg",
            "image2": "https://i.pinimg.com/736x/9a/9f/c0/9a9fc068bea5eb0cbb89d33808bda6d8.jpg",
            "video": "https://www.youtube.com/embed/e5mUJ_AjeK8?si=-9p9J2NnYCXSSreE"
        },
        {
            "hidden-gems": "Shri Kashi Kaamkoteeshwar Mandir",
            "category": "Religious / Tantric Temple ",
            "lat-lon": "25.2981° N, 83.0064° E",
            "address": "72X4+7H3, Harischandra Road, Near Hanuman Ghat, Bangali Tola, Varanasi, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/6eE39xopYD8vBj2A9",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "No Rare (only with experienced heritage guides)",
            "establish-year": 1974,
            "fee": " Free; Guide: ₹200–₹400 (as niche site)",
            "description": "Shri Kashi Kaamkoteeshwar Mandir is a sacred and relatively lesser-known temple dedicated to Lord Shiva in his wish-fulfilling form. Located in the spiritual heart of Varanasi, this temple is believed to grant the pure desires of devotees who worship with sincerity and devotion. The deity here is referred to as \"Kaamkoteeshwar,\" meaning the one who fulfills all righteous wishes. The temple radiates a serene and powerful energy, attracting seekers, yogis, and pilgrims who seek blessings, peace, and spiritual upliftment. Surrounded by the deep religious aura of Kashi, this temple holds a unique place for those on a spiritual quest or seeking divine intervention in their lives.",
            "essential": "The temple is open from early morning to late evening, with aarti timings at dawn and dusk being ideal for visits. Entry is free, and modest clothing is advised. Photography inside the sanctum is discouraged. Devotees often bring offerings like flowers, incense, and milk. Leather items, alcohol, and non-veg food are not allowed. Visitors must remove footwear before entering and maintain cleanliness and silence. The temple lies within Varanasi’s narrow lanes, requiring a short walk to reach.",
            "story": "The Kaamkoteeshwar Mandir is a rare and ancient temple dedicated to Lord Shiva in his Kaamkoteeshwar form, the granter of pure desires. As described in the Kashi Khand, this temple is spiritually significant for its power to fulfill dharmic wishes. It is a quiet, lesser-known site with a self-manifested (Svayambhu) lingam, and its sanctity is maintained by its simplicity and seclusion. Local devotees and saints have long visited this shrine for spiritual clarity, peace, and guidance. The temple is most powerful for those who come with sincere, righteous intent. Unlike commercial or crowded temples, this one emphasizes inner devotion over ritualism, and during Mahashivratri, it sees a modest but heartfelt flow of pilgrims.",
            "image0": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTv3w3Vd-QZiXet-4W_naHbrDb-SQ0vp8B0-w&s",
            "image1": "https://myadhyatm.com/wp-content/uploads/2023/07/1-158-471x445.jpg",
            "image2": "https://myadhyatm.com/wp-content/uploads/2023/07/5-93-800x445.jpg",
            "video": "https://www.youtube.com/embed/jJ7ZGP0uSfM?si=_RjHVOGOryPfOtXF"
        },
        {
            "hidden-gems": "Lolark Kund",
            "category": "Ritual Site / Ancient Stepwell",
            "lat-lon": "25.2911° N, 83.0058° E",
            "address": "Shivala, Varanasi, Uttar Pradesh 221005",
            "location-link": "https://maps.app.goo.gl/jn986q4RkXtstmJ17",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "yes Available (part of southern Varanasi tours)",
            "establish-year": "4th century",
            "fee": "Free; Ritual ₹50–₹200; Guide: ₹150–₹300",
            "description": "Lolark Kund is one of the oldest and most revered stepwells in Varanasi, dedicated to Surya Dev (the Sun God). Located in the Lolark Aditya area near Tulsi Ghat, this ancient water tank holds deep religious significance, especially among couples seeking blessings for fertility and childbearing. The tank is believed to have miraculous powers, and during the Lolark Shashti festival, thousands of devotees take a holy dip, leaving behind clothes or offerings in hopes of fulfilling their desires. The kund’s stepped architecture, sacred aura, and strong belief system make it a rare spiritual site in the heart of Kashi, blending faith with tradition.",
            "essential": "Lolark Kund is open throughout the day and is best visited during early morning hours, especially during festivals. Entry is free, and photography is allowed. Modest attire and respectful behavior are expected. Bathing in the kund is believed to grant fertility blessings, particularly during Lolark Shashti. Leather items, alcohol, and non-veg food are strictly prohibited. Visitors must avoid polluting the water and maintain cleanliness around the sacred site. The kund is accessible by foot through the lanes near Tulsi Ghat.",
            "story": "Lolark Kund, near Tulsi Ghat, is one of the oldest sun shrines in India, dating back to the Vedic period. It is dedicated to Surya Dev (Sun God) and is believed to possess divine fertility and healing powers. The name “Lolark” means “trembling sun,” representing the powerful spiritual energy believed to emanate from this place. During the Lolark Shashti festival, thousands of childless couples dip in its stepped tank to seek blessings for offspring. It is customary to leave behind clothes, jewelry, and symbolic items as offerings of surrender and gratitude. The tank’s architecture is trapezoidal and ancient, and the water is not used for routine bathing but reserved for sacred rituals only. The sunlight’s reflection on the kund during sunrise is considered especially auspicious and spiritually energizing.",
            "image0": "https://upload.wikimedia.org/wikipedia/commons/9/90/Vertigo_View_At_Varanasi_Lolark_Kund_%28243970515%29.jpeg",
            "image1": "https://live.staticflickr.com/65535/49078672272_b970fa5b7d_b.jpg",
            "image2": "https://pin.it/2RcstBCv8",
            "video": "https://www.youtube.com/embed/GR8fGU5ar9A?si=oHwpU03GSxSIZkyR"
        },
        {
            "hidden-gems": "Pita Maheshwar",
            "category": "Mystical Shiva Shrine / Esoteric Site",
            "lat-lon": "25.2911° N, 83.0058° E",
            "address": "96, Shitala Gali, Ghasi Tola, Varanasi, Domari, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/EEMSG9ccLZybr51P7",
            "open-day": "Monday to Sunday",
            "open-time": "24 Hours open",
            "guide-availiblity": "No Rare (needs knowledgeable spiritual guide)",
            "establish-year": "Not available",
            "fee": "Free; Guide: ₹250–₹500",
            "description": "Pita Maheshwar is one of the most mysterious and spiritually potent shrines in Varanasi, believed to be located in an underground chamber below the sacred city. Mentioned in the Kashi Khand of the Skanda Purana, this form of Lord Shiva is worshipped as the foundation of Kashi itself. It is said that visiting or even remembering Pita Maheshwar grants liberation (moksha), as it represents the cosmic root from which the divine energy of Kashi emerges. While the shrine is not easily accessible to the public, the deep spiritual belief attached to it draws seekers, especially those on a path of inner awakening and liberation.",
            "essential": "Pita Maheshwar is not a typical public temple; it lies underground and is generally not open for regular darshan. Only a few are granted access with special permission. Visitors are advised to respect its spiritual secrecy and sanctity. No entry fee is charged, and strict decorum is expected. Photography, loud behavior, and unclean conduct are strictly prohibited. As with all sacred spaces in Kashi, leather items, alcohol, and non-vegetarian food are not allowed. The site is revered more through remembrance and faith than through physical visitation.",
            "story": "Pita Maheshwar is one of the most hidden and metaphysically powerful forms of Lord Shiva in Varanasi. The name means the “base or foundation of Maheshwar (Shiva)”, and it represents the invisible spiritual support of the entire city of Kashi. Mentioned in the Kashi Khand, it is said to lie deep beneath the earth, not easily accessible, and not visible to ordinary devotees. Instead of being worshipped through rituals, Pita Maheshwar is honored through remembrance, meditation, and surrender. Even Lord Vishwanath, the ruling deity of Kashi, is said to draw power from Pita Maheshwar. Saints and yogis have meditated upon this form to attain moksha (liberation). Its mysterious nature enhances its reverence, reminding seekers that the greatest spiritual truths lie beyond what can be seen or touched, in the eternal silence beneath",
            "image0": "https://sahasa.in/wp-content/uploads/2021/09/pita-maheshwar-varanasi-uttar-pradesh-e1631683394372.jpg",
            "image1": "https://files.yappe.in/place/full/pita-maheshwar-mahadev-temple-kashi-khand-4463547.webp",
            "image2": "https://www.varanasiguru.com/wp-content",
            "video": "https://www.youtube.com/embed/QtodHqcCAmc?si=jPhVZh4df6socl-f"
        }
    ],
    "Nearby-tourist-spot": [
        {
            "places ": "Shri Kashi Karvat Temple(baba ratneshwar mahadev)",
            "distance": "1.2km from godowlia chowk varanasi",
            "category": "Religious/Pilgrimage",
            "lat-lon": "25.3114931° N, 83.0098823° E",
            "address": "Nepali Khapra, Ghats of Varanasi, Katesar, Varanasi, Domari,(U.P.)221001",
            "location-link": "https://maps.app.goo.gl/vSG3Lq8GCBcauUCw5",
            "open-day": "Monday-Sunday",
            "open-time": "6:30 am–10:30 pm",
            "guide availiblity": "yes",
            "establish-year": "ancient",
            "fee": "free",
            "description": "The Kashi Karvat Temple, also known as Ratneshwar Mahadev Temple, is an ancient Shiva temple in Varanasi, India, known for its unique leaning structure. It's located near the Kashi Vishwanath Temple and the Manikarnika Ghat, and is famous for its significant tilt, even more pronounced than the Leaning Tower of Pisa. ",
            "essential": "Do not pray inside the temple;follow the local rules;refrain from alcohol;remove shoes at the ghat;don't try go near the temple when submerged in the river;modest dress codes",
            "story": "Among the legends revolving around the partially submerged temple of Ratneshwar, the most popular one is of a boy named Man Singh, who wanted to pay off his mother's (Ratna Bai) love. But she refused to break the bond from her end, instead, asked him to do so from his end. So the son decided to come to the holy city of Kashi and built Lord Shiva's temple and that's how he tried to clear the debt of love. As the story goes, after the construction his mother cursed the temple stating that nothing can pay off a mother's love for her child. And since then the temple was damned and remains submerged in water.According to another story, it is believed that the temple was built by a female servant of Ahilya Bai of Indore, named Ratna Bai. Ahilya Bai cursed it to lean because her servant had named it after herself.The temple is elegantly constructed in the classical style of architecture with a nagara shikhara and phamsana mandapa.",
            "image0": "https://i.pinimg.com/736x/ae/c1/8b/aec18b4bf42647f78dbe5d505f3b8a03.jpg",
            "image1": "https://i.pinimg.com/736x/38/c3/75/38c3751b05b4fe70d69596aad18ef40e.jpg",
            "image2": "https://kevinstandagephotography.wordpress.com/wp-content/uploads/2020/05/cover-1.jpg",
            "video": "https://www.youtube.com/embed/iqsQ1jN5JLA?si=z9ULnl_y13IwqSXF"
        },
        {
            "places ": "Ramnagar Fort",
            "distance": "6.7km from godowlia chowk varanasi",
            "category": "Historic/Forts",
            "lat-lon": "25.2695243° N, 83.0203852° E",
            "address": "Varanasi Rd, Ram nagar, Ramnagar,(U.P.)221008",
            "location-link": "https://maps.app.goo.gl/YWQoiMeABNV8KdR9A",
            "open-day": "Monday-Sunday",
            "open-time": "10:00am-5:00pm",
            "guide availiblity": "yes ",
            "establish-year": 1750,
            "fee": "75rs(adults),20rs(kids),200rs(foreign tourists)",
            "description": "The Ramnagar Fort is a fortification in Ramnagar, Varanasi, India. It is located near the Ganges on its eastern bank, opposite to the Tulsi Ghat. The sandstone structure was built in 1750 by Kashi Naresh Maharaja Balwant Singh. The current king and the resident of the fort is Anant Narayan Singh, who is also known as the Maharaja of Benares.The fort is at a scenic location on the eastern right bank of the Ganges River.The building was constructed with creamy-coloured chunar sandstone. The fort houses the Veda Vyasa Temple, a museum, and the king's residential complex.[5] There is also a Dakshin Mukhi temple of Hanuman, which faces towards south.",
            "essential": "Photography not allowed inside the gallery;do not litter in the premises;chewing tabacoo is not allowed;carry water on hot days",
            "story": "The museum is known as Saraswati Bhawan. The museum is in what used to be the Durbar Hall or the Public Audience Hall of the fort. It is well known for its unusual and rare collections of American vintage cars, bejeweled sedan chairs, ivory work, medieval costumes, gold and silver brocaded royal Palakis (Palanquins in the shape of a lotus flower). It has elephant saddles carved out of silver, jewellery, costumes made of kimkhwa silk (finest product of the weavers of Varanasi), an impressive armoury hall with swords, old guns from Africa, Burma and Japan.",
            "image0": "https://i.pinimg.com/736x/95/a9/d5/95a9d53e43c18cc021a9d39e9c344da9.jpg",
            "image1": "https://i.pinimg.com/736x/a4/45/e8/a445e844c2991fce8ef46f9d60e65abf.jpg",
            "image2": "https://upload.wikimedia.org/wikipedia/commons/8/89/Entrance_area_of_Ramnagar_Fort.jpg",
            "video": "https://www.youtube.com/embed/sFzn6641YhY?si=hPDb7HzdEvuSEBzb"
        },
        {
            "places ": "Sarnath ",
            "distance": "13km from godowlia chowk varanasi",
            "category": "historic city/Pilgrimage",
            "lat-lon": "25.3729358° N, 83.0042352° E",
            "address": "Sarnath Varanasi(U.P.)221007",
            "location-link": "https://maps.app.goo.gl/Nw2FEaD6dHDtBuJN7",
            "open-day": "Monday-Sunday",
            "open-time": "6:00am-5:00pm",
            "guide availiblity": "yes",
            "establish-year": "3rd century BCE",
            "fee": "250rs(Dhamek Stupa) ,30rs(chaukhandi stupa)",
            "description": "The name Sarnath is derived from Saranganath that translates as, “Lord of the Deer”Sarnath is one of the eight most important pilgrimage sites for Buddhists, and has been nominated to become a UNESCO World Heritage Site.Sarnath is located eight kilometres (five miles) northeast of Varanasi near the confluence of the Ganges and the Varuna rivers.Sarnath is where Gautama Buddha's sangha first convened, when he gave the first teaching to the Buddha's original five disciples",
            "essential": "Carry a hat and water during hot days;Maintain silence inside the Stupa;be respectful to the monument and its significance",
            "story": "It’s the site where Gautama Buddha delivered his first sermon after attaining enlightenment. This event is called the Dhammacakkappavattana Sutta — “Turning the Wheel of Dharma.” After attaining enlightenment under the Bodhi tree in Bodh Gaya, Gautama Buddha traveled to Sarnath (then called Isipatana) in search of the five ascetics (his former companions). Sarnath thus became the birthplace of organized Buddhism.In the 3rd century BCE, Emperor Ashoka visited Sarnath and contributed significantly to its development by constructing the Dhamek Stupa and the Ashokan Pillar, both bearing inscriptions that promoted non-violence and dharma. Between the 5th and 12th centuries CE, Sarnath flourished as a major center of learning, filled with temples and monasteries that attracted scholars and monks from across Asia. However, in the 12th century, the site suffered destruction during the Turkish invasions. It remained in ruins until it was rediscovered by the British in the 19th century, sparking archaeological interest and preservation efforts.",
            "image0": "https://i.pinimg.com/736x/6d/cc/42/6dcc42665d4aa6cc9d20c3bf86f22557.jpg",
            "image1": "https://i.pinimg.com/736x/a0/cc/99/a0cc99b3f23d3c3b9b2e3ed8f3c8dcd5.jpg",
            "image2": "https://i.pinimg.com/736x/e7/11/23/e711236903baa11fad29167f5703ab70.jpg",
            "video": "https://www.youtube.com/embed/1mfqVupHH0E?si=IMC7v-u75hn8QGup"
        },
        {
            "places ": "Chunar Fort",
            "distance": "31km from godowlia chowk varanasi",
            "category": "Historic/Forts",
            "lat-lon": "25.1233625° N, 82.8731595° E",
            "address": "Tammanpatti,(U.P.)231304",
            "location-link": "https://maps.app.goo.gl/1zrUK6DdC6PoqCJE7",
            "open-day": "Monday-Sunday",
            "open-time": "7:00am-5:00pm",
            "guide availiblity": "yes",
            "establish-year": "11th century ",
            "fee": "free",
            "description": "The Chunar Fort (also known as Chandrakanta Chunargarh and Charanadri) is located in Mirzapur district of Uttar Pradesh.The fort stands on a rock, a detached part of the Vindhya Range, at an elevation of 280 feet (85 m) above sea level. It was built in a commanding position, high above a meander in the Ganges River, near the Kaimur Hills. The approach to Chunar Hill is marked by a chain of low hills, running parallel to the river on its right bank, which is covered by plantations and bungalows.",
            "essential": "Wear steardy  shoes;take basic food supplies;refrain from alcohol",
            "story": "There are many legends linking the fort to divine aspects. One such is the story of King Bali. God, known in these parts as Bawan Bhagwan, appeared before Bali, disguised as a Brahmin, and begged for three feet of land. The generous king agreed. God placed his first step on the hill of Chunar Fort and left his foot mark there. Since then it is known as \"Charanadri\", which over the years took the short form of \"Chunar\".The second legend is king Vikramāditya of Ujjain. His brother Bharthari, who opted to live the life of a hermit, started living near the rockface of Chunar. Realising his brother's situation, Vikramadiathya visited Chunar, and after finding out his brother's whereabouts through the hermit Goraknath, built a house for his brother to live in. The black stone where the saint Bhatinath lived and prayed is worshiped even now, as it is believed that Bhatinath is seated in the fort area in an invisible form.A third legend linked the fort to the well known king of Rajasthan. Prithviraj brought this settlement under his rule and also many neighbouring villages. Subsequent to his demise, his descendants sold the land to Khair-ud-din Subuktagin. An inscription (not very legible) in Sanskrit on the gateway of the fort mentions that the place had been taken over by Swami Raja, who had established a stone tablet recording the event. Later, the fort was acquired by Sahab-ud-din.",
            "image0": "https://i.pinimg.com/736x/ea/cf/31/eacf31f744b8e496d8313844bf5781a2.jpg",
            "image1": "https://s7ap1.scene7.com/is/image/incredibleindia/chunar-fort-varanasi-2-attr-hero?qlt=82&ts=1727353641764",
            "image2": "https://s7ap1.scene7.com/is/image/incredibleindia/chunar-fort-varanasi-1-attr-hero?qlt=82&ts=1727353274712",
            "video": "https://www.youtube.com/embed/z69DgWkt5pc?si=SK4tkzS0cYlURHCy"
        },
        {
            "places ": "Markandey Mahadev",
            "distance": "34km from godowlia chowk varanasi",
            "category": "Religious/Pilgrimage",
            "lat-lon": "25.4070537° N, 82.9237134° E",
            "address": "Markanday Mahadev Mandir, Kaithi,(U.P.)221116",
            "location-link": "https://maps.app.goo.gl/NV63StmbghcvRjgQ9",
            "open-day": "Monday-Sunday",
            "open-time": "5:00am-11:00pm",
            "guide availiblity": "no",
            "establish-year": "ancient",
            "fee": "free",
            "description": "The temple is situated in Kaithi, a village near Varanasi, and is believed to be the place where Markandeya performed his penance.The temple is considered an important pilgrimage site for devotees of Lord Shiva, who come to seek blessings and experience the spiritual atmosphere. The temple is designed in a traditional North Indian style, with intricate carvings and designs that depict scenes from Hindu mythology.",
            "essential": "Modest dress code;refrain from any alcohol;remove shoes at temple;follow local guidelines during rituals and bathing at ghats",
            "story": "The temple's history is intertwined with the story of Rishi Markandeya, who was blessed by Lord Shiva with immortality after he pleased the deity with his intense devotion and prayers. Markandeya, born with a short lifespan, was saved by Shiva from the clutches of Yama (the god of death) at this very spot. Shiva is said to have emerged from the Shiva Linga (the temple's main deity) to protect Markandeya, granting him eternal life and making him forever young.",
            "image0": "https://sugamdarshan.com/Upload/markandeya%20mahadev%20(header)%2001.png",
            "image1": "https://markandeymahadevkaithi.com/images/Markandey-Mahadev-Ghat.png",
            "image2": "https://img77.uenicdn.com/image/upload/v1642756483/business/9117a45c-1454-4648-be43-266f00a37923.jpg",
            "video": "https://www.youtube.com/embed/Vph6_wQYN08?si=bbU25upOTHYMTH3D"
        },
        {
            "places ": "Lakhaniya Dari Waterfall",
            "distance": "46km from godowlia chowk varanasi",
            "category": "Nature/Waterfall",
            "lat-lon": "24.9586245° N, 83.0064276° E",
            "address": "Latifpur, (U.P.)231301",
            "location-link": "https://maps.app.goo.gl/cN6cawtPfUTUAjE17",
            "open-day": "Monday-Sunday",
            "open-time": "9:00am-5:00pm",
            "guide availiblity": "yes",
            "establish-year": "natural",
            "fee": "5rs",
            "description": "A short, rugged hike leads to this popular scenic waterfall in a tranquil forest setting.Lakhaniya Dari Waterfall it is located along the Lakhaniya Valley, about 50 kilometres south of Varanasi.The waterfall has a height of 150 metres.This water is famous among trekkers and sports enthusiast",
            "essential": "Do not go inside the water body until permitted;refrain from carrying any alcohol or cigarettes.;wear steardy shoes ",
            "story": "Lakhaniya Dari Falls is one stunning water body, set about 30 km from the ancient town of Chunar in the district of Mirzapur, Uttar Pradesh. To witness the waterfall in all its glory, you must visit here during the monsoons. Pouring from a height of 150 m, these falls make for a pretty enchanting sight. The entire region is covered in huge boulders and rocks and rivulets. You can also go explore the town of Chunar, which is known for its pottery tradition and handicrafts.",
            "image0": "https://shorturl.at/5S5aZ",
            "image1": "https://shorturl.at/jcJc4",
            "image2": "https://shorturl.at/zF24G",
            "video": "https://www.youtube.com/embed/1RAP4rpFRLY?si=6JqBgMnLniDOKOHa"
        },
        {
            "places ": "Rajdari & Devdari Waterfalls",
            "distance": "62km from godowlia chowk varanasi",
            "category": "Nature/Waterfall",
            "lat-lon": "24.9462016° N, 82.9350484° E",
            "address": "Chandauli district (U.P.)",
            "location-link": "https://maps.app.goo.gl/8oF1kqvDWAenSWmAA",
            "open-day": "Monday-Sunday",
            "open-time": "6 :00am–6:00 pm",
            "guide availiblity": "yes",
            "establish-year": "natural",
            "fee": "50rs/300rs(foreign tourists)",
            "description": "Rajdari and Devdari Waterfalls are among the most prominent tourist attractions in the Chandauli district. Nestled within the scenic Chandraprabha Wildlife Sanctuary—originally established for the conservation of Asiatic lions—these waterfalls offer a stunning display of nature. With water cascading from high rocky cliffs, the beauty of Rajdari and Devdari is truly mesmerizing. Surrounded by serene, mystical landscapes far from the chaos of city life, this destination provides a perfect escape into nature’s tranquility.",
            "essential": "Take basic food supplies;lack of food spots on route;reach early morning;wear steardy shoes;take a extra pair of clothing;do not go deep in the fall in monsoon seasons;no facilities or accomodation available",
            "story": "The Rajdari and Devdari waterfalls are found in the Chandraprabha Wildlife Sanctuary. The sanctuary was established to conserve Asiatic lions and though their population has dwindled, there are several species of animals and birds that live here. Apart from the animals and birds, the sanctuary is home to several other attractions, more notably the Rajdari and Devdari waterfalls. The crystal clear waters, gurgling over the rocks present a breathtaking sight. The scenic, tranquil surroundings lend a sense of mysticism to the experience.",
            "image0": "https://shorturl.at/v7Zch",
            "image1": "https://shorturl.at/LbKa1",
            "image2": "https://shorturl.at/W6joL",
            "video": "https://www.youtube.com/embed/TWLBgNhHaeQ?si=lX5ZPi8_t7cuMBzo"
        },
        {
            "places ": "Vindhyachal(Maa Vindhyavasini temple)",
            "distance": "68km from godowlia chowk varanasi",
            "category": "Religious/Pilgrimage",
            "lat-lon": "25.3134809° N, 83.0167529° E",
            "address": "Vindhyachal Gali, Rajadarwaja, Bulanala, Varanasi, Uttar Pradesh 221001",
            "location-link": "https://maps.app.goo.gl/fkafWkP7acssNpFJ9",
            "open-day": "Monday-Sunday",
            "open-time": "8:30 am–10:30 pm",
            "guide availiblity": "no",
            "establish-year": "ancient(mythic)",
            "fee": "free",
            "description": "It is a renowned religious city dedicated to the goddess Vindhyavasini (daughter of Yashoda-Nanda).The Vindhyavasini Devi Temple is situated 8 km from Mirzapur, on the banks of the holy river Ganga.There are several temples of other deities in the vicinity, the most famous ones being Ashtabhuja Devi Temple and Kalikhoh Temple",
            "essential": "Modest dress codes;refrain from any alcohol;remove shoes at temples;follow local guidelines during rituals and while bathing at ghats",
            "story": "The city is a Hindu pilgrimage site having the temple of Vindhyavasini, who according to Markandeya Purana, had incarnated to kill the demon Mahishasura.Vindhyachal Temple, also known as Maa Vindhyavasini Temple and Vindhyachal Dham is one of the Shakti Pitha temples in India.The temple has been mentioned in Durga Saptashati.",
            "image0": "https://shorturl.at/H7DrY",
            "image1": "https://shorturl.at/dB43k",
            "image2": "https://shorturl.at/Kfh5u",
            "video": "https://www.youtube.com/embed/9K-k67RkyD8?si=ncCp_kBw73GIRTxa"
        },
        {
            "places ": "Tanda Falls",
            "distance": "76km from godowlia chowk varanasi",
            "category": "Scenic Spot/Waterfall",
            "lat-lon": "25.0578624° N, 82.5136391° E",
            "address": "Tanda Fall Rd, Tand, Pagar, (U.P.) 231211",
            "location-link": "https://maps.app.goo.gl/Sn3KutN3vR4GAmfs5",
            "open-day": "Monday-Sunday",
            "open-time": "8:00am-4:00pm**",
            "guide availiblity": "no",
            "establish-year": 1940,
            "fee": "50rs [50rs (parking)]",
            "description": "Tanda Falls in Mirzapur is a standout amongst the most picturesque outing spots in the district. The normal water stream and water store are real vacation spots on account of their serene climate and rich magnificence. The waterfall is effortlessly open by street and lies around 14 km south of the fundamental city of Mirzapur.",
            "essential": "Needs a suv to reach as road is steep and rocky;only good in the monsoon season;take basic food supplies;reach early;wear steardy shoes as terrain is rocky;take a extra pair of clothes ,towels",
            "story": "A man made fall that was built approximately 90 years ago has risen to be a key spot among tourists in all these years.Tanda Falls in Mirzapur is a standout amongst the most picturesque outing spots in the district. The normal water stream and water store are real vacation spots on account of their serene climate and rich magnificence. The waterfall is effortlessly open by street and lies around 14 km south of the fundamental city of Mirzapur",
            "image0": "https://www.exploreourindia.com/backend/web/images/post/big/6285_Tanda%20Falls.webp",
            "image1": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/34/19/bc/dried-up-tanda-falls.jpg?w=800&h=-1&s=1",
            "image2": "https://www.hlimg.com/images/things2do/738X538/ttd_1522918035m3.png?w=576&dpr=2.0",
            "video": "https://www.youtube.com/embed/k7UWmX083ec?si=zo-R2xU_JKjb3xpo"
        },
        {
            "places ": "Sitamarhi Temple(Sita Samahit Sthal)",
            "distance": "84km from godowlia chowk varanasi",
            "category": "Religious/Pilgrimage",
            "lat-lon": "25.2729551° N, 82.2550681° E",
            "address": "Sitamarhi, Bhadohi,(U.P.)221309",
            "location-link": "https://maps.app.goo.gl/vsCk9jNj2qvSJzoG6",
            "open-day": "Monday-Sunday",
            "open-time": "5am-12pm,2pm-9pm",
            "guide availiblity": "yes",
            "establish-year": "ancient(mythic)",
            "fee": "free",
            "description": "Sitamarhi is a historical place of immense significance and is being visited by large number of pilgrims with great faith and devotion. It is one of the five ‘Teerths’ (holy places) in Purvanchal which are Prayagraj, Sitamarhi,Sarnath. Vindhyavasini & Kashiraj, all can be visited within 3 days.This temple is situated on the banks of Ganga river and It is believed that at this place Mother Sita had absorbed herself in the earth.",
            "essential": "Modest dree codes;refrain from any alcohol;remove shoes at the temple;follow local guidelines during rituals;beaware of monkeys",
            "story": "Sitamarhi has got immense significance, because it was here that Lord Rama’s wife Maa Sitaji was abandoned, gave birth to Luv & Kush and descended into the lap of Mother Earth forever. The only existing Valmiki Ashram on the banks of the river Ganges is located here .Once the place was visited by Swami Jitendranand Tirth and he had desired that a very magnificent memorial to Sitaji be built here. The Sita Samahit temple stands exactly on the mound where Bhagwati Sitaji descended into Mother Earth. This was built with the kind help of Late Shri. Satya Narain Prakash Punj, New Delhi who was inspired by his mother. Within the campus of the main temple there exists temples of Maa Sita & Lord Shiva. There also stands 108 ft. high statue of Ram Bhakt Hanuman installed on an artificial rock of 20 ft. Under this hillock there is a cave having small temple of Hanumanji",
            "image0": "https://i0.wp.com/prayagpedia.com/wp-content/uploads/2024/07/410586833_847765840691949_8668328409451795046_n.jpg?w=1080&ssl=1",
            "image1": "https://holyvoyages.com/images/tour-packages/same-day-varanasi-vindhyachal-sitamarhi-tour.webp",
            "image2": "https://cdn.s3waas.gov.in/s30266e33d3f546cb5436a10798e657d97/uploads/bfi_thumb/2018070535-olw6i5692r50xohhi4lokbge8gdovfp43ovifg3ki2.jpg",
            "video": "https://www.youtube.com/embed/gSIm9hP9HwA?si=uEuggGbh3gxV8d1M"
        },
        {
            "places ": "Shaktipeeth Shivdwar (Shiv Durga Temple)",
            "distance": "92km from godowlia chowk varanasi",
            "category": "Religious/Pilgrimage",
            "lat-lon": "27.4182196° N, 78.4750441° E",
            "address": "Sonbhadra, Uttar Pradesh",
            "location-link": "https://maps.app.goo.gl/c1BbTLT4Mz1ZxUcr5",
            "open-day": "Monday-Sunday",
            "open-time": "6:00am-8:00pm",
            "guide availiblity": "no",
            "establish-year": "ancient(mythic)",
            "fee": "free",
            "description": "Shivdwar, officially known as Uma Maheshwar Temple, is located 10 km from Ghorawal in Sonbhadra district, Uttar Pradesh.The specialty of Shivdwar Dham is that it has the idol of Lord Shiva and Mother Parvati and that too together. The 11th century black stone idol of Goddess Parvati is kept in the sanctum  of this temple. This three feet high idol is placed in Srijan Mudra which is a creative posture.This statue is an example of excellent artistry. This temple displays fine examples of craftsmanship and magnificent art of that period",
            "essential": "Modest dress codes;refrain from any alcohol;remove shoes at temples;follow local guidelines during rituals ",
            "story": "Shivdwar, also known as Uma Maheshwar Temple, is a Shaktipeeth (a place of Shakti worship) located in Sonbhadra district, Uttar Pradesh, dedicated to Lord Shiva and Goddess Parvati. It is unique because it houses an idol of Shiva and Parvati, where water is offered to the deities rather than the traditional lingam. The templeis a significant pilgrimage site, particularly during the month of Shravan.It is believed that in the fourth decade of the 19th century, while plowing the fields, a village farmer named Moti Mahato found the unique statue of the famous Umamaheshwar in Satdwari village. When the idol was found, everyone considered it a blessing from God. Then this idol was installed by Avinash Kuwari, daughter-in-law of the village’s landlord family, and the temple was constructed. This temple was named Shivdwar.",
            "image0": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Shivdwar.jpg/500px-Shivdwar.jpg",
            "image1": "https://i0.wp.com/hamarapurvanchal.com/wp-content/uploads/2018/05/shivdwar.jpg?w=1280&ssl=1",
            "image2": "https://i0.wp.com/hamarapurvanchal.com/wp-content/uploads/2018/05/IMG_20180520_135732145-1.jpg?w=1280&ssl=1",
            "video": "https://www.youtube.com/embed/Xj8gh3dNZO8?si=REzdluuHv9DkKbH2"
        }
    ]
}