{
  "hiddengem": [
    {
      "_id": "68c7f22920f4dc4834768ac3",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "hiddenGem": "Korai Village",
      "category": "Cultural / Rural Experience",
      "lat": 27.1264,
      "lon": 77.677,
      "address": "Korai Village,Uttar Pradesh",
      "locationLink": "https://maps.app.goo.gl/ukm5FhPHarn4hjdo7",
      "openDay": "Monday to Sunday",
      "openTime": "24 hours open",
      "establishYear": null,
      "fee": "FREE",
      "description": "Korai Village, located near Fatehpur Sikri, offers a rare glimpse into the life of the Kalandar tribe, once famous for performing with monkeys. Today, the village showcases authentic rural culture, traditional crafts, and tribal heritage through responsible community tourism. Visitors can experience local food, music, and storytelling while learning about the villagers’ efforts to preserve their identity post the ban on animal performances. A visit to Korai is not just cultural but also human—shedding light on a resilient community that has gracefully adapted to modern challenges without losing its roots.",
      "essential": "Visitors should respect the privacy and dignity of the local Kalandar community. Photography is allowed but must be done with permission, especially when capturing people or homes. Dress modestly to align with rural customs. Loud behavior or commercial promotion without consent is discouraged. Tourists are advised to take guided tours to understand the culture better and avoid cultural insensitivity. Littering is strictly prohibited. Visitors are encouraged to support local artisans by buying handmade products directly. Entry is usually FREE, but donations to village development are welcome.",
      "story": "Korai Village, located near the Fatehpur Sikri complex in Agra district, is a tribal village predominantly inhabited by the Kalandar community, once known for their tradition of keeping performing monkeys. The village reflects a vanishing cultural legacy where generations survived through street performances and nomadic lifestyles until laws banning animal performances forced them to shift. The Kalandars, descendants of wandering Sufi fakirs, once entertained emperors and commoners alike, but modernization pushed their heritage to the margins. Today, Korai Village stands as a living cultural site where visitors can witness rural life, traditional cooking, crafts, and the stories of resilience from the Kalandar people. It has evolved into a model for community-based tourism, offering an authentic view into the lifestyle and social challenges of this marginalized group. The transformation of the village into a tourist-friendly space was supported by local development initiatives, aiming to preserve the community's dignity while offering them alternative livelihoods. Through simple homestays, folk art, and storytelling, Korai Village is now a bridge between fading traditions and new beginnings. It offers a rare window into a part of India that is rarely seen, allowing history, culture, and human perseverance to converge in one place.",
      "images": [
        "https://www.tourmyindia.com/socialimg/korai-village-agra.jpg",
        "https://media.tacdn.com/media/attractions-splice-spp-674x446/07/1e/4b/6c.jpg",
        "https://media.tacdn.com/media/attractions-splice-spp-674x446/06/70/06/de.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/68QJ5BS0Gdk?si=PHHPB1YVFhWPELz1"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c7f22920f4dc4834768ac7",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "hiddenGem": "Roman Catholic Cemetery (Padre ka Bagh)",
      "category": "Heritage / Historical Landmark",
      "lat": 27.2097,
      "lon": 78.0024,
      "address": "6254+V2V, Nehru Nagar, Civil Lines, Agra, Uttar Pradesh 282003",
      "locationLink": "https://maps.app.goo.gl/LdXEFyKtw85r3Jyo6",
      "openDay": "Monday to Sunday",
      "openTime": "24 hours open",
      "establishYear": "~1500",
      "fee": "FREE",
      "description": "Padre ka Bagh, or the Roman Catholic Cemetery in Agra, is one of India’s oldest Christian burial grounds, dating back to the late 1500s. Located near St. Peter’s Church, the cemetery contains elaborately carved tombs of European missionaries, soldiers, and officials from the Mughal and British periods. Among its most notable graves is that of Father Rudolf Aquaviva, a Jesuit priest from Akbar’s court. The site’s blend of Mughal and Christian architecture reflects Agra’s multicultural past and serves as a quiet, historical enclave amidst the city's bustling heritage landscape.",
      "essential": "Visitors should maintain a respectful and solemn demeanor at all times. Photography is allowed but must be discreet—avoid standing or walking on graves. No food, drinks, or smoking is allowed inside. Entry is usually FREE and permitted during daylight hours. Loud conversations, music, or group tours without prior permission are discouraged. Cleanliness is expected—do not litter or damage the tombs. Historical researchers and photographers may need to obtain permission for detailed documentation. Visitors should treat the site as a sacred heritage monument.",
      "story": "The Roman Catholic Cemetery in Agra, popularly known as Padre ka Bagh, is one of the oldest Christian cemeteries in North India, dating back to the late 16th century during the Mughal era. Nestled in a quiet part of the city, this historical burial ground is a silent chronicle of Agra’s colonial and multicultural past. Among its most notable tombs is that of Father Rudolf Aquaviva, a Jesuit priest who was part of Emperor Akbar’s court and played a key role in religious dialogues at the famous Ibadat Khana in Fatehpur Sikri. Many European soldiers, missionaries, and officials who served during the Mughal and British periods are buried here, and their elaborately inscribed tombstones—many in Latin and Persian—reflect the confluence of Eastern and Western worlds. The architecture of the cemetery blends Mughal motifs with Christian symbolism, and its layout resembles a garden (bagh), which gives the place a serene and reflective atmosphere. Though lesser-known among tourists, Padre ka Bagh is a vital heritage site that captures the layers of Agra’s religious diversity and its importance as a cosmopolitan center even during Mughal rule. The site is maintained by the local Catholic community, and efforts are ongoing to preserve its aging tombs and inscriptions, which hold immense historical value. Padre ka Bagh is not just a cemetery, but a quiet witness to centuries of faith, diplomacy, and cultural exchange, making it an essential yet often overlooked part of Agra’s historical landscape.",
      "images": [
        "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/dd/7d/7a/tombs-in-roman-catholic.jpg?w=1200&h=-1&s=1",
        "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxt2UHwAFCObt7vFBtBgX-A4hwBF1SvSsPgDh9mJLMxrNsgYriWUWUJGKtWSFVNFayDRXPbLoVre-fOMdKwpy3W7fT4TOCcSLYvW-F8t6JtAzSiZK8uTLJR01admqy54rmEvMXk16n9HU/s1600/Agra+Roman+Catholic+Cemetery+Red+Taj.jpg",
        "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjjh4rgzPkk8Vv87k40dd_pNlqDjE_BxDJk67kPy1yMlBuKJlr4H1V5KWcX_RFa3t5_qkPJo7BBGwxvsqxXLRhPNnrf-FThk4hIdgyYbKiKVXOhbyD8frj7KV0yEXGpFtmIHVsZgEIaUu0/s1600/Agra+Roman+Catholic+Cemetery+Overhead.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/Tlq383v837I?si=30pOzGliQD_v7H7Q"
      ],
      "premium": "A"
    },
    {
      "_id": "68c7f22920f4dc4834768ac5",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "hiddenGem": "Mankameshwar Temple",
      "category": "Religious / Spiritual Temple",
      "lat": 27.1836,
      "lon": 73.4032,
      "address": "Daresi Rd, Rawatpara, Sheb Bazar, Mantola, Agra, Uttar Pradesh 282003",
      "locationLink": "https://maps.app.goo.gl/chX1k1XPQ514QgTx7",
      "openDay": "Monday to Sunday",
      "openTime": "05:00AM - 10:00PM",
      "establishYear": "Very old at the time of load Krishna (Dvapara Yuag",
      "fee": "FREE",
      "description": "Located close to Agra Fort, Mankameshwar Temple is a sacred Hindu shrine dedicated to Lord Shiva and is believed to date back to the Ramayana era. It houses a self-manifested Shivling that draws devotees throughout the year, especially during the month of Shravan and on Mahashivratri. The name \"Mankameshwar\" suggests fulfillment of heartfelt wishes, making the temple a popular destination for those seeking divine blessings. Its spiritual charm and daily rituals provide a strong contrast to the surrounding Mughal-era architecture, reflecting Agra’s rich blend of history and faith.",
      "essential": "Footwear must be removed before entering the temple premises. Modest clothing is expected out of respect for religious customs. Photography inside the inner sanctum is not allowed. Offerings like milk, flowers, and water are permitted. Non-vegetarian food, alcohol, and smoking are strictly prohibited within the temple grounds. Queues can get long during festivals—maintain order and follow staff directions. Mobile phones should be used on silent mode, and avoid making loud calls inside. Entry is FREE for all visitors. Respect the peaceful and devotional environment.",
      "story": "Mankameshwar Temple, located near Agra Fort, is one of the oldest and most revered temples dedicated to Lord Shiva in the city, believed to fulfill the heartfelt desires (mankamna) of its devotees. Legend has it that Lord Shiva established the lingam here during his journey to Lanka with Lord Rama, making the temple spiritually linked to the Ramayana era. The black stone Shivling housed in the sanctum is said to be self-manifested (Swayambhu), and its energy is considered so sacred that devotees flock here especially during Mondays, Shravan month, and Mahashivratri. Though simple in architecture, the temple’s aura is charged with centuries of faith, daily rituals, and the continuous ringing of bells by pilgrims seeking blessings. Surrounding the temple are smaller shrines dedicated to deities like Goddess Parvati, Lord Ganesha, and Hanuman, creating a complete spiritual complex in the heart of bustling old Agra. The temple's proximity to key Mughal landmarks like Agra Fort stands as a powerful contrast—an ancient Hindu shrine surviving and thriving through centuries of political change. Locals believe that any sincere prayer offered here with pure devotion is always answered, making it not just a site of ritual worship but also of deep emotional connection for generations of Agra's residents. The temple is a living symbol of cultural continuity, where myth, history, and daily life blend seamlessly in the city's sacred rhythm.",
      "images": [
        "https://i.pinimg.com/736x/ac/53/ec/ac53ec4b70cf2af41dae8138ab149fbe.jpg",
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTkKhcFLO--br7oB3tjM4vdOOhwT9OtV_WezA&s",
        "https://agratourism.in/images//tourist-places/shri-mankameshwar-mandir-agra/shri-mankameshwar-mandir-agra-india-tourism-photo-gallery.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/h0nfTkyzUH4?si=JNSFPxNemzahlmPJ"
      ],
      "premium": "A"
    },
    {
      "_id": "68c7f22920f4dc4834768ac6",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "hiddenGem": "Radha Swami Samadhi",
      "category": "Religious / Spiritual / Heritage Site",
      "lat": 27.2227,
      "lon": 78.0047,
      "address": "Poiya Ghat Rd, Swamibagh, DayalBagh, Agra, Uttar Pradesh 282005",
      "locationLink": "https://maps.app.goo.gl/Yf8MYf4B3NP58MwC8",
      "openDay": "Monday to Sunday",
      "openTime": "10:00AM - 04:00PM",
      "establishYear": "1915",
      "fee": "FREE",
      "description": "Radha Swami Samadhi, located in Soami Bagh, Agra, is a marble mausoleum dedicated to Swamiji Maharaj, the founder of the Radha Soami faith. Under construction for over a century, the structure is a fusion of spiritual symbolism and architectural brilliance. The site attracts followers from across the world who come to meditate and attend satsangs. Emphasizing inner devotion and universal love, the Samadhi is not just a memorial but a living center of spiritual practice. Its peaceful ambiance and intricate carvings make it a unique blend of religion, art, and timeless reverence.",
      "essential": "Visitors should maintain silence and spiritual decorum inside the complex. Footwear is not allowed inside the main temple area. Photography is strictly prohibited. No offerings are needed, as the Radha Soami tradition emphasizes internal devotion over rituals. Smoking, alcohol, and loud behavior are not permitted. Only vegetarian food is allowed on the premises. Visitors are encouraged to attend satsangs quietly and respectfully. Entry is FREE, but donations to the temple are accepted. Men and women should dress simply and modestly.",
      "story": "Radha Swami Samadhi, located in Soami Bagh, Agra, is a grand memorial dedicated to the founder of the Radha Soami faith, Param Purush Swamiji Maharaj (Shiv Dayal Singh), who initiated a spiritual movement based on inner meditation and universal love in the mid-19th century. The structure, built in pure white marble, has been under continuous construction for over a century, often compared in ambition and craftsmanship to the Taj Mahal. It stands not only as a mausoleum but as a symbol of eternal devotion, spiritual discipline, and the community's dedication to their Guru. The Radha Soami movement, which originated in Agra, emphasizes Sant Mat—the path of the saints—encouraging seekers to experience divine truth through inner light and sound meditation. The Samadhi itself is a masterpiece of Indo-European architecture, blending detailed carvings, spiritual symbolism, and flawless symmetry. It is not merely a resting place for the Guru but a living center for devotees who come from across India and abroad to meditate and attend satsangs (spiritual discourses). The ongoing construction, conducted without haste and purely by donations, reflects the belief that such a sacred structure should evolve organically with time and faith. The Radha Swami Samadhi is a rare blend of spirituality, devotion, and timeless architecture, representing a movement that continues to inspire millions in search of inner truth and peace.",
      "images": [
        "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/77/c5/36/photo2jpg.jpg?w=1200&h=-1&s=1",
        "https://s7ap1.scene7.com/is/image/incredibleindia/radhasoami-samadhi-or-soamibagh-temple-agra-1-attr-hero?qlt=82&ts=1726650388060",
        "https://a.travel-assets.com/findyours-php/viewfinder/images/res70/123000/123994-Agra.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/ElhtG1br8xc?si=yEW--D6Ur3P3bMpn"
      ],
      "premium": "FREE"
    }
  ]
}