{
  "nearbyspot": [
    {
      "_id": "68c7f22920f4dc4834768ac9",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "places": "Dayalbagh (Radhasoami Memorial Complex)",
      "distance": "8.6km from agra fort agra",
      "category": "Religious",
      "lat": 27.2228,
      "lon": 77.9371,
      "address": "Poiya Ghat Rd, Swamibagh, DayalBagh, Agra, Uttar Pradesh 282005",
      "locationLink": "https://maps.app.goo.gl/1BM8j8UhwzVNZ9BF6",
      "openDay": "Monday-Sunday",
      "openTime": "10:00am-4:00pm",
      "establishYear": "1904",
      "fee": "FREE",
      "description": "Radhasoami Satsang Dayalbagh is century old spiritual tradition and the main sect of Radhasoami Mat with its Headquarter in Agra (Birth Place of Radhasoami Sant Mat) located on the banks of Yamuna River.Dayal Bagh is open to all its admirers on all days of the week, and there is no entry fee.While Dayal Bagh can be visited throughout the year, the best time is spring when the garden is fully blooming. Spring season mostly lasts from February to April.",
      "essential": "Wear modest clothes;follow the temple rules;refrain from any alcohol;be carefull of the construction",
      "story": "The foundation of the Dayal Bagh colony was laid on the first day of spring, 15th January 1915, by Sir Anand Swarup (Huzur Sahab Ji Maharaj), the fifth revered leader of the Radha Swami sect, by planting a mulberry tree.Originally conceived as an ashram or spiritual home for the faith, Dayal Bagh has grown into a thriving community through voluntary contributions in money and labour from its early residents.The entire Dayal Bagh and Swami Bagh area was nothing but dunes once. The community's dedication to claim the land, an initiative in 1943 by Huzur Mehtaji Maharaj, had resulted in the present-day 1200-acre lush green farm producing various crops",
      "images": [
        "https://agratourism.in/images/places-to-visit/headers/dayal-bagh-agra-tourism-entry-fee-timings-holidays-reviews-header.jpg",
        "https://img.traveltriangle.com/blog/wp-content/uploads/2024/08/Soami-Bagh-Agra.jpg",
        "https://d3sftlgbtusmnv.cloudfront.net/blog/wp-content/uploads/2025/01/Location-1.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/THWeJ59vqjY?si=df4xLknRVIF5e3XI"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c7f22920f4dc4834768acc",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "places": "Mathura/Vrindavan",
      "distance": "60km from agra fort agra",
      "category": "Religious/pilgrimage",
      "lat": 27.5648,
      "lon": 77.577,
      "address": "Mathura-Vrindavan ,U.P.",
      "locationLink": "https://maps.app.goo.gl/Lx2nB2tVEoryP59bA",
      "openDay": "Monday-Sunday",
      "openTime": "8:00am-9:30pm",
      "establishYear": "ancient",
      "fee": "FREE",
      "description": "Vrindavan also spelt Vrindaban and Brindaban, is a historical city in the Mathura district of Uttar Pradesh, India. It is located in the Braj Bhoomi region and holds religious importance for Hindus who believe that Krishna, one of the main Gods in Hinduism, spent most of his childhood in this city.Vrindavan has about 5,500 temples dedicated to the worship of Krishna.It is one of the most sacred places for Vaishnava traditions.",
      "essential": "Wear modest clothing;follow temple rules;refrain from any alcohol;follow local rituals in temples;most places are shut between 12noon-4:40pm [plan accordingly]",
      "story": "Vrindavan has an ancient past, associated with Hindu culture and history, and was established in the 16th and 17th centuries.Situated on the west bank of the Yamuna River, about 15 kilometres north of Mathura.It is believed that Krishna spent part of his childhood in this city.The other prominent areas surrounding Vrindavan are Govardhana, Gokul, Nandgaon, Barsana, Mathura and Bhandirvan.Millions of devotees of Radha Krishna visit Vrindavan and its nearby areas every year to participate in a number of festival.",
      "images": [
        "https://i.pinimg.com/736x/c8/6b/4a/c86b4a3f4b4ee8c8ed34616360d08d76.jpg",
        "https://i.pinimg.com/736x/86/76/f1/8676f1af06794dfcda37eb6e8a52876d.jpg",
        "https://i.pinimg.com/736x/66/24/49/6624492af492435931909428009da683.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/LbuLcLJ1tLg?si=2beVZjVq4n2e4jU9"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c7f22920f4dc4834768acd",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "places": "Bateshwar Temples (Bateshwar Dham)",
      "distance": "78km from agra fort agra",
      "category": "Religious/historic",
      "lat": 26.9347,
      "lon": 78.5401,
      "address": "Dham, Bateshwar, Uttar Pradesh 283104",
      "locationLink": "https://maps.app.goo.gl/1zfVk9rZgtMQCqkJ9",
      "openDay": "Monday-Sunday",
      "openTime": "4:00am-9:00pm",
      "establishYear": "ancient",
      "fee": "FREE",
      "description": "The site is mentioned in historical literature as Dharon or Paravali, later as Padavali. The local name for the group of temples is Batesvar or Bateshwar temples.These temples have a \"simple pillared wall topped by a broad, flat-edged awning which extends beyond the sanctum to shade the entry as well. The square pillars rest directly on the vedibandha, and are crowned by \"leaf capitals, their shafts engraved with decorative medallions",
      "essential": "Follow the local rules;Modest dress code;refrain from any alcohol;remove shoes at temple;follow local guidelines during rituals ",
      "story": "The Bateshwar Hindu temples are a group of nearly 200 sandstone Hindu temples and their ruins in north Madhya Pradesh in post-Gupta, early Gurjara-Pratihara style of North Indian temple architectureThey are dedicated to Shiva, Vishnu and Shakti - representing the three major traditions within Hinduism. The site is within the Chambal River valley ravines, on the north-western slope of a hill near Padavali known for its major medieval era Vishnu temple.",
      "images": [
        "https://agratourism.in/images/places-to-visit/headers/bateshwar-agra-header-agra-tourism.jpg.jpg",
        "https://i.pinimg.com/1200x/d7/65/88/d7658801d9769813a3756fdbd0003499.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Bateshwar_Temple_Complex_-_3.jpg/500px-Bateshwar_Temple_Complex_-_3.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/bnfMZjTKBas?si=wb72U-1APwDYyEiV"
      ],
      "premium": "A"
    },
    {
      "_id": "68c7f22920f4dc4834768acb",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "places": "Lohagarh Fort",
      "distance": "60km from agra fort to agra",
      "category": "Historic/Forts",
      "lat": 27.222,
      "lon": 77.4917,
      "address": "Lohagarh Fort, Gopalgarh, Bharatpur, Rajasthan 321001",
      "locationLink": "https://maps.app.goo.gl/uf8TtmsSxVyNWSKx9",
      "openDay": "Monday-Sunday",
      "openTime": "10:00am-6;00pm",
      "establishYear": "1732",
      "fee": "FREE,[museum:Rs22(indians),Rs100(foreigners)]",
      "description": "Lohagarh Fort, an 18th-century structure located in Bharatpur, Rajasthan, is known for its formidable design and historical significance. The fort has two prominent gates: the Ashtadhatu Gate on the north, made from an alloy of eight metals, and the Chowburja Gate on the south, distinguished by its four-pillared structure. Inside the fort are notable buildings such as Kishori Mahal, Mahal Khas, and Kothi Khas. Several components of Lohagarh Fort have been designated as Monuments of National Importance in Rajasthan, including the Jawahar Burj, Ashtadhatu Gateway, the surrounding moat, the fort walls along with the Chowburja Gate, and the approach bridges at both the Chowburja and Ashtadhatu gates.",
      "essential": "Wear steardy shoes;modest dress code;refrain from any alcohol;remove shoes at temple",
      "story": "Lohagarh Fort, an 18th-century fort located in Bharatpur, Rajasthan, stands as a powerful testament to the strength and strategic brilliance of the Jat rulers, particularly Maharaja Suraj Mal, who commissioned its construction in 1732. Unlike many other forts of the era, Lohagarh was built for defense rather than decoration, and its formidable structure successfully resisted numerous invasions. The British army made thirteen attempts to capture the fort but failed to breach its defenses even once. Most notably, during the Siege of Bharatpur in January and February 1805, British forces led by Lord Lake launched four major assaults on the fortress—all of which were unsuccessful. Among the key monuments within the fort, Jawahar Burj holds historical significance as it was constructed by Maharaja Jawahar Singh in 1765 to commemorate his victory over the Mughals at the Battle of Delhi in 1764. It later became the site for coronation ceremonies of Bharatpur’s rulers. Another prominent structure, Fateh Burj, was built by Raja Ranjeet Singh in 1805 to celebrate his triumph over the British during the same siege.",
      "images": [
        "https://i.pinimg.com/1200x/6e/b6/b8/6eb6b863f91b19b703e3b0cd81a347c1.jpg",
        "https://i.pinimg.com/1200x/94/f0/b2/94f0b249307e9d20b64f22e3ee0c724d.jpg",
        "https://www.rajasthantourplanner.com/blog/wp-content/uploads/2021/11/Bharatpur-Lohagarh-Fort.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/qNzkgKXelUE?si=O_oUCF6lq7-aora8"
      ],
      "premium": "A"
    },
    {
      "_id": "68c7f22920f4dc4834768aca",
      "cityId": "68c7454b4ea2df675385f351",
      "cityName": "Agra",
      "places": "Keoladeo National Park",
      "distance": "57km from agra fort agra",
      "category": "Wildlife sanctuary",
      "lat": 27.1596,
      "lon": 77.5192,
      "address": "Bharatpur, Rajasthan 321001",
      "locationLink": "https://maps.app.goo.gl/akUz337veQVaU8nG8",
      "openDay": "Monday-Sunday",
      "openTime": "6:00am-5:00pm",
      "establishYear": "1982",
      "fee": "Rs75(indians),Rs500(Foreigners)",
      "description": "Keoladeo National Park is a famous avifauna sanctuary in Bharatpur, Rajasthan, 55 km away from Agra. It’s popular for bird-watching as it hosts thousands of birds, especially during winter. Bharatpur Keoladeo National Park also offers trekking and boating facilities.Winter (November to February) is the best season to visit Keoladeo National Park. Migratory birds flock to the lake during those days, mostly in December and January. The weather is the most suitable for exploring this time. Dawn and dusk are the best time to go on a safari.It takes around 3-4 hours to explore Keoladeo Ghana National Park on a rickshaw. But it’s best if you have a day to spare.",
      "essential": "Be back before dark;stay aware of wild animals;do not litter ;carry water;prefer a guide for accurate information",
      "story": "Keoladeo National Park (or Keoladeo Ghana National Park) is a breathtaking wilderness in the heart of India. It was earlier known as Bharatpur Bird Sanctuary, and it’s an enchanting, lush green paradise near Agra.Keoladeo Ghana Bird Sanctuary/National Park is a mosaic of dry grasslands, woodlands and wetlands. And what was once a waterfowl hunting ground is now an abode for birds and other wildlifet’s considered among the richest bird areas in the world.This bird park houses resident birds as well as visiting migratory birds from Siberia, China and other places. The fresh air, laden with the melodies of birds, invites scores of tourists to explore this fascinating ecosystem. It’s a paradise for bird watchers.in 1981, Keoladeo Ghana National Park Bharatpur was listed under Ramsar sites. Later, in 1985, it was declared a UNESCO World Heritage Site.",
      "images": [
        "https://i.pinimg.com/736x/87/90/e9/8790e9b55b0505c2759484b5499cd1f1.jpg",
        "https://i.pinimg.com/1200x/02/11/92/0211929547615f65938260f3f0018889.jpg",
        "https://whc.unesco.org/uploads/thumbs/site_0340_0001-360-360-20110923001811.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/XwwZkHLVtCI?si=sPZgRfuuxFuBxbXL"
      ],
      "premium": "FREE"
    }
  ]
}