{
  "hiddengem": [
    {
      "_id": "68c7f5bb20f4dc4834768c3a",
      "cityId": "68c7454b4ea2df675385f354",
      "cityName": "Mahabaleshwar",
      "hiddenGem": "Kamalgad Fort",
      "category": "Historic/Fort",
      "lat": 17.9673,
      "lon": 73.7426,
      "address": "Nandgane, Maharashtra (412803)",
      "locationLink": "https://maps.app.goo.gl/BDT49PTg3KbHhSuk6",
      "openDay": "Monday-Sunday",
      "openTime": "6:00am-6:00pm",
      "establishYear": "historic",
      "fee": "free",
      "description": "Kamalgad, also called Bhelanja or Kattalgad (literally death fort) is a square hill fort in Wai Taluka in Maharashtra, India.The fort covers a flat area, 3-4 acres in size. It is surrounded by steep rock and can only be reached by perilously scaling this rock.The base village of the fort is Tupewadi which is 30 km from Wai and 46 km from Bhor.",
      "essential": "Wear comfortable pair of shoes;best visited in daylight hours;carry food and water",
      "story": "The builder of the fort is unknown. During Maratha times, Kamalgad, Pandavgad and other forts in the area were administered by a mokasaddar (manager) from Bijapur.In April 1818, Kamalgad surrendered after resistance to a British detachment commanded by a Major Thatcher.Under the British, it was used to execute prisoners of war.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196248/foaodllp4jaw8r1ngqir.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196249/ugoslqljqbtnom29x2g2.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196250/ebn0bhkfnff6owqontvr.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/X2LU47eIl80?si=s7aHkqaNKUHKM7l8"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c7f5bb20f4dc4834768c3c",
      "cityId": "68c7454b4ea2df675385f354",
      "cityName": "Mahabaleshwar",
      "hiddenGem": "Kaas Plateau",
      "category": "Nature/Scenic spot",
      "lat": 17.7181,
      "lon": 73.8118,
      "address": "Kaas plateau,Maharashtra",
      "locationLink": "https://maps.app.goo.gl/9DvEDf1LoYCiDXn46",
      "openDay": "Monday-Sunday",
      "openTime": "7:00am-6:00pm",
      "establishYear": "natural",
      "fee": "50rs(Weekdays),100rs(Weekends)",
      "description": "The Kas Plateau Reserved Forest, also known as the Kaas Pathar, is a plateau situated 25 kilometres west from Satara city .It is a biodiversity hotspot known for various types of seasonal wild flowers bloom and numerous species of endemic butterflies annually in the months of August and September.Kaas has more than 850 different species of flowering plants.",
      "essential": "do not pluck any flora;follow the local rules;best visited during daylight hours",
      "story": "Kaas plateau is a plateau located near Satara. It is situated high hill plateaus and grasslands turns into a 'valley of flowers' during monsoon season, particularly from August to early October.Kaas Plateau has more than 150 or more types of flowers, shrubs and grasses. The orchids bloom here for a period of 3–4 weeks during this season. Kaas plateau is a World Natural Heritage site, part of the Sahyadri Sub-cluster.There are two ways to reach Kaas. one the more direct way from Satara and another from Tapola via the link road connecting Mahabaleshwar and Panchgani to Kas Pathar.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196260/hlyslkctcwnrtnvcio4g.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196261/ztivzpaww6qkqil7zvxm.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196263/sktl6lzm3l11qp9czh6n.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/GbIzauLSds8?si=GKHOjWA6OWp7QW2y"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c7f5bb20f4dc4834768c3e",
      "cityId": "68c7454b4ea2df675385f354",
      "cityName": "Mahabaleshwar",
      "hiddenGem": "Chalkewadi Windmill Farms",
      "category": "Nature/Scenic spot",
      "lat": 17.5851,
      "lon": 73.8305,
      "address": "Chalkewadi, Maharashtra (415014)",
      "locationLink": "https://maps.app.goo.gl/he2Sg8GoeU4pVP4D8",
      "openDay": "Monday-Sunday",
      "openTime": "24 Hours open",
      "establishYear": "1998",
      "fee": "free",
      "description": "At a distance of 6 km from Thoseghar Falls and 29 km from Satara, Chalkewadi Windmill Farm is one of the largest windmill farms in Asia situated at Chalkewadi in Satara district of Maharashtra. It is among the popular Satara tourist places.Set amidst lush green hills, valleys and the red soil these windmills make a beautiful sight. It can only be accessed by a private vehicle since no state buses ply in this route. This is another place that is best visited during the monsoon since the misty weather makes Chalkewadi windmill farm a very picturesque place. There is a small pond near the windmill farm",
      "essential": "Carry food and water;best visited during daylight hours;wear comfortable pair of shoes",
      "story": "Chalkewadi Wind Energy Project in Satara was developed with the intention of generating clean energy. There are hundreds of windmills on the adjoining hills. The windmills are stretched over a 5 km plateau and supply electricity to Satara and neighboring places like Mahabaleshwar and Panchgani. Chalkewadi is developed as a tourist spot, because the windmills and the hills offer a magical landscape together. Thoseghar waterfall can be seen from Chalkewadi.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196271/nkvqncefzzre6huiijax.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196272/rq33wtepyfdeybcyvkyq.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196273/ljwfjc9w2dckd3yqwhhy.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/cIRATu3e5-s?si=FogzqCAjGWT60tg-"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c7f5bb20f4dc4834768c3d",
      "cityId": "68c7454b4ea2df675385f354",
      "cityName": "Mahabaleshwar",
      "hiddenGem": "Thoseghar Waterfalls",
      "category": "Natural/Waterfall",
      "lat": 17.5974,
      "lon": 73.8441,
      "address": "satara-sajjangadh, road, Thoseghar, Maharashtra (415013)",
      "locationLink": "https://maps.app.goo.gl/8pzBHycvtneVyukR8",
      "openDay": "Monday-Sunday",
      "openTime": "8:00am–6:00pm",
      "establishYear": "natural",
      "fee": "50rs",
      "description": "Thoseghar Waterfalls get its name from the small village of Thoseghar located 20 km from Satara. We will pass Sajjangad Fort and windmills to reach the scenic Thoseghar Waterfalls.Thoseghar offers spectacular views with a series of waterfalls converging and one waterfall 200 meters in height.The best time to visit Thoseghar Waterfall is from July to November or on a Rainy day.",
      "essential": "Do no go in waters during heavy rains;follow the local rules;carry ample food and water",
      "story": "Thoseghar waterfalls is a scenic spot located near the small village of Thoseghar, 20 km from Satara city, at the edge of the Konkan region, in Western India.People come from all over Maharashtra to visit the area, especially during the rainy or monsoon season, July to November.There is a picnic area and a newly constructed platform which gives a good view of the waterfall. This platform can be entered in the valley, but it is not safe to do so when it is raining heavily.One can spot many birds near the waterfall. People visit from all over to visit the Thoseghar Waterfalls especially during the rainy or monsoon season.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196266/b59vafrbf0dm5fy5eyzp.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196267/tnf3g3j5hwf7prg9ddir.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196268/a8fk8mvmht8bdoxmk86t.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/-pGytNhLq_U?si=_47WWBAq9Vmm5AuN"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c7f5bb20f4dc4834768c3b",
      "cityId": "68c7454b4ea2df675385f354",
      "cityName": "Mahabaleshwar",
      "hiddenGem": "Tapola(Mini Kashmir)",
      "category": "Nature/Scenic spot",
      "lat": 17.7618,
      "lon": 73.7412,
      "address": "Tapola, Maharashtra (412806)",
      "locationLink": "https://maps.app.goo.gl/pwVqkCCaFhYeM7ca6",
      "openDay": "Monday-Sunday",
      "openTime": "24 Hours open (8:00am-4:00pm {Boat Club timmings})",
      "establishYear": "natural",
      "fee": "free",
      "description": "The Tapola village is a beautiful spot that offers a picturesque atmosphere for tourists to relax, unwind, and attain peace of mind.Visit the famous Tapola Lake to enjoy the surreal setting and sunset views at their best. It’s a popular picnic spot for families with children and is frequently visited by adventure seekers interested in trying their hand at activities like swimming, kayaking, paragliding, and boating.",
      "essential": "Beaware of tourists trap;do not go near waters during heavy rains;best visited as overnight stay",
      "story": "Uncover the charm of Tapola, a serene lakeside destination known for its breathtaking views and rich culture. Nestled amidst the lush greenery of the Western Ghats, Tapola is often referred to as the 'Mini Kashmir' of Maharashtra. This hidden gem is a paradise for nature lovers, offering stunning landscapes, tranquil waters, and an abundance of outdoor activities. Visitors can indulge in a variety of experiences, from leisurely boat rides on the pristine Tapola Lake to exploring the surrounding hills and forests that are teeming with wildlife.There is no entry fee to explore the surroundings of Tapola village but in case you wish to go boating, you’ll need to pay INR 750 per person for a speed boat for 45 minutes and INR 1400 per person for one and half an hour ride.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196254/erqfwiok7aphowefltik.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196257/uhvlnlf0lsq96pbyarzs.webp",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757196258/y04uycgt4h8lruxzwvsu.png"
      ],
      "videos": [
        "https://www.youtube.com/embed/mNmgWH1pxfU?si=zINLAvu7gP85cFm2"
      ],
      "premium": "A"
    }
  ]
}