{
  "hiddengem": [
    {
      "_id": "68c875339dad7b39dff585b4",
      "cityId": "68c7454b4ea2df675385f355",
      "cityName": "Kolkata",
      "hiddenGem": "Chandannagar",
      "category": "Historical Town/Cultural City",
      "lat": 22.8616,
      "lon": 88.3478,
      "address": "Chandannagar,West Bengal",
      "locationLink": "https://maps.app.goo.gl/zNS1fxMRDK5yW8QZA",
      "openDay": "Monday–Sunday",
      "openTime": "Opens 24/7",
      "establishYear": "1673",
      "fee": "FREE",
      "description": "Chandannagar, also known as Chandernagor, is a city in West Bengal’s Hooghly district, renowned for its distinctive French colonial legacy. The city showcases this heritage through its well-preserved colonial architecture, the iconic Strand, landmarks like the Dupleix House Museum, and remnants of its French past. Once a French colony until 1951, Chandannagar continues to embody a unique fusion of Bengali traditions and French cultural influence.",
      "essential": "Wear comfortable shoes;Carry an umbrella in summers;Best visited in daytime;Follow local rules",
      "story": "Chandannagar emerged during the colonial era, as evidenced by the absence of its mention in medieval Bengali texts. Historians believe the French established the town by merging several smaller localities in the region. In 1688, Boureau-Deslandes, the first Director of the French East India Company, paid 40,000 coins to the Mughal subahdar to secure rights over the area and set up a trading factory. The first Frenchman to acquire land here was Du Plessis, who purchased 13 arpents at Boro Kishanganj. Later, in 1730, Joseph François Dupleix became governor, under whose administration more than two thousand brick houses were built, and the town developed into a hub of thriving maritime trade.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960933/plbh2wgqdgivb2hlcpe9.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960935/pnupugopoxxnthwgeoou.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960936/h8ladfolm81duerimwfo.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/y74G8G33khc?si=6AO4ilOiNgtclTPi"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c875339dad7b39dff585b5",
      "cityId": "68c7454b4ea2df675385f355",
      "cityName": "Kolkata",
      "hiddenGem": "Chinsurah",
      "category": "Historical Town/Cultural City",
      "lat": 22.9027,
      "lon": 88.3485,
      "address": "Chinsurah,West Bengal",
      "locationLink": "https://maps.app.goo.gl/ttorabazrrh1eYyc8",
      "openDay": "Monday–Sunday",
      "openTime": "Opens 24/7",
      "establishYear": "17th century",
      "fee": "FREE",
      "description": "Chinsurah, located on the banks of the Hooghly River about 35 km north of Kolkata, is home to the oldest Armenian church in India as well as several historic Hindu temples. The town is well connected by rail, with three stations on the Howrah line—Chinsurah (CNS), Hooghly (HGY), and Bandel Junction (BDC)—alongside Hooghly Ghat (HYG) on the Sealdah line. Local transportation is primarily served by buses, autos, rickshaws, and totos.",
      "essential": "Wear comfortable shoes;Carry an umbrella in summers;Best visited in daytime;Follow local rules",
      "story": "The Portuguese established the town of Ugulim in 1579, though the region’s heritage stretches back thousands of years to the powerful kingdom of Bhurshut. As a trading port, the town prospered and saw the construction of several religious sites, including a Christian church dedicated to a statue of Mary brought by the Portuguese. In 1629, political turmoil led the Mughal governor of Bengal to expel the Portuguese. During their retreat, the statue was lost in the river but was later recovered by locals on the riverbank. Following the expulsion, the town was designated the royal port of Bengal, with all public offices and records relocated there. In 1640, the East India Company set up a factory in Hugli, marking its first settlement in Lower Bengal.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960939/ehey76adlzx5h6kwcssl.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960939/dyyzr8b01gwch2dcm197.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960940/gvboewmiwtjgzcdzzkr5.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/R7T8DhyKEQQ?si=9kmq44hkJuHVbi1a"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c875339dad7b39dff585b7",
      "cityId": "68c7454b4ea2df675385f355",
      "cityName": "Kolkata",
      "hiddenGem": "Diamond Harbour",
      "category": "Natural/River Bank",
      "lat": 22.1977,
      "lon": 88.1591,
      "address": "Diamond Harbour,West Bengal",
      "locationLink": "https://maps.app.goo.gl/mFEbT9Cr1oyiMGo59",
      "openDay": "Monday–Sunday",
      "openTime": "Opens 24/7",
      "establishYear": "17th century",
      "fee": "FREE",
      "description": "Diamond Harbour, formerly known as Hajipur, is a historic riverside town in West Bengal situated on the banks of the Hugli River. It developed as an important center for agricultural trade and port activities, while also gaining popularity as a tourist destination for its pleasant climate, scenic river views, and proximity to places like Gangasagar. The British gave it the name Diamond Harbour, reflecting its significance as a hub for both river and sea shipping.",
      "essential": "Wear comfortable shoes;Carry an umbrella in summers;Best visited in daytime;Follow local rules;Refrain from the water body if water level is high",
      "story": "Diamond Harbour, originally called Hajipur due to its location along the Hajipur creek, was renamed by the British, who used it as a base for both river and sea shipping. The area has been known since the 16th and 17th centuries for the presence of Portuguese river pirates, locally referred to as *harmad*. A fort known as Chingrikhali Kella, believed to have been built by these pirates in the 1600s, still stands today in a dilapidated state.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960948/wuee4sd5oyfywyhzl2hu.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960950/sbaiebtf2bcq9x13xfzo.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960951/zjzrn8ralmsu8uvyorg3.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/WZDZ_xGESs4?si=kQKRhLnyHfuesJYb"
      ],
      "premium": "FREE"
    },
    {
      "_id": "68c875339dad7b39dff585b6",
      "cityId": "68c7454b4ea2df675385f355",
      "cityName": "Kolkata",
      "hiddenGem": "Bansberia",
      "category": "Historical Town/Cultural City",
      "lat": 22.9577,
      "lon": 88.3733,
      "address": "Bansberia,Mithapukur More, West Bengal",
      "locationLink": "https://maps.app.goo.gl/VDanDfxwVi6xadCPA",
      "openDay": "Monday–Sunday",
      "openTime": "Opens 24/7",
      "establishYear": "17th century",
      "fee": "FREE",
      "description": "Bansberia, once a principal city of the ancient Saptagram region, holds significant historical importance. Located in today’s Hooghly district of West Bengal, it is home to the Zafar Khan Ghazi Mosque and Dargah at Tribeni, which are regarded as some of the earliest surviving Muslim monuments in Bengal. An inscription dates the mosque to 698 AH (1298 AD), highlighting its deep-rooted heritage.",
      "essential": "Wear modest clothing;Cover your head in the mosque;Wear comfortable shoes;Carry an umbrella in summers;Best visited in daytime;Follow local rules",
      "story": "The Zafar Khan Ghazi Mosque and Dargah at Tribeni in Hooghly district, West Bengal, are among the earliest surviving Muslim monuments in Bengal. Built during the initial phase of the Muslim conquest of the region, the mosque is an oblong structure measuring 23.38 by 10.53 metres (76.7 by 34.5 ft) externally. It represents the earliest known example of the brick-and-stone construction style introduced by the Muslims in Bengal, replacing the traditional Hindu technique of stacking rectangular cut stones without mortar.",
      "images": [
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960943/uekrl6wsh2xxs1ztj6iq.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960944/uoeu6yebom1mq4ilkagx.jpg",
        "https://res.cloudinary.com/dmpo42qxm/image/upload/v1757960945/dtogqxzz8f6smiwgtcac.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/T1ajD0hSZNM?si=wSmMH5o-Xt2gN2Sf"
      ],
      "premium": "FREE"
    }
  ]
}